import { ScrollView, StyleSheet, Text, View } from "react-native";
import CustomBackground from "../../../components/Background/Background";
export default function RohaniIlajTaruf() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>روحانی علاج کا مختصر تعارف </Text>
          <Text style={styles.description}>
            ادارہ روحانیات کے شعبہ روحانی کی بنیاد 2001 میںاپنے اساتذہ کی دعاؤں
            اور سرپرستی میں رکھی گئی۔ الحمدللہ 2001 سے یہ شعبہ تاحال بلا تفریق
            مذھب و مسلک، عوام کی خدمت میں مصروف ہے۔ کئی عاملین اور روحانی
            معالجین اس شعبے میں اپنی خدمات انجام دے چکے ہیں اور دے رہے ہیں۔
            الحمدللہ! ایک کثیر تعداد میں اندرون اور بیرون ملک سائلین اور روحانی
            مریض فیض یاب ہو چکے ہیں۔
          </Text>
          <Text style={styles.description}>
            نظرِبد، جادو اور جنات کے متاثرہ مریضوں کا روحانی علاج، ہر قسم کی
            مصیبتوں و پریشانیوں سے نجات، روحانی و جسمانی بیماریوں سے شفاء، جائز
            مقاصد کے حصول اور حاجتوں کے پورا ہونے کے لیے زود اثر اور تیر بہدف
            قرآن کریم، حد یث نبوی صلی اللہ علیہ و آلہ وسلم، بزرگانِ دین،
            علمائے کرام اور ماہرین فنِ عملیات کے مستند، انمول و مجرب عملیات و
            تعویذات کو بروئے کار لاتے ہوئے روحانی رہنمائی اور روحانی علاج کیا
            جاتا ہے۔
          </Text>
          <Text style={styles.description}>
            نظرِبد، جادو اور جنات کے متاثرہ مریضوں کی روحانی علاج کے ساتھ ساتھ
            مکمل رہنمائی بھی کی جاتی ہے تاکہ آئندہ مبتلا نہ ہوں۔ ان کو حفاظت کے
            خاص طریقے بتائے اور سکھائے جاتے ہیں ۔ جہاں ضرورت محسوس ہو، مریضوں کو
            حفاظتی اعمال کی چلہ کشی کروائی جاتی ہے۔سالہا سال سے جنات اور جادو کی
            اذیت میں مبتلا، سحرِ مسلسل (مسلسل جادو) کےمریضوں کو روحانی اعمال کی
            اجازت دی جاتی ہے اور چلہ کشی بھی کروائی جاتی ہے تاکہ وہ اس قابل ہوں
            کہ آئندہ خودسے اپنا اور اپنے اہل و عیال کا روحانی علاج کر سکیں۔
          </Text>
          <Text style={styles.subheading}>
            تشخیص کی ضرورت اور عاملین اور عوام کی غفلت
          </Text>
          <Text style={styles.description}>
            روحانی معالجین کی بھی بہت بڑی غلطی ہے کہ وہ روحانی علاج تو شروع کر
            دیتے ہیں مگر تشخیص پر توجہ نہیں دیتے۔ اسی طرح عوام کا حال ہے کہ وہ
            وظائف؍علاج تو شروع کر دیتے ہیں مگر تشخیص نہیں کرواتے۔ یاد رکھیں!
            صحیح تشخیص ہو گی تو صحیح علاج بھی ہوگا۔ روحانی علاج یا وظائف کرنا
            ایسا ہی ہے جیسے کسی بیماری کے لیے دوا استعمال کی جائے۔ اگر بیماری کی
            تشخیص ہی نہیں تو پھر دوا لینا کہاں کی عقلمندی ہے؟ بغیر تشخیص کے کبھی
            کوئی دوا، کبھی کوئی دوا لینے سے شفاء ہونا تو درکنار، شفاء کا راستہ
            ہی بند ہو جاتا ہے۔ پھر کوئی صحیح دوا بھی اثر نہیں کرتی۔ یہی حال پھر
            روحانی علاج میں بھی ہوتا ہے۔ بغیر تشخیص کے قسم قسم کے علاج کروا کر
            کیس کو اتنا بگاڑ لیتے ہیں کہ کیس کو سنبھالنے کے لیے بہت وقت اور بہت
            محنت درکار ہوتی ہے۔
          </Text>
          <Text style={styles.subheading}>روحانی تشخیص کا تعارف</Text>
          <Text style={styles.description}>
            روحانی تشخیص کا مقصد یہ ہے کہ ہم کسی انسان یا جگہ پر سحر، جنات، آسیب
            یا نظرِ بد کے اثرات کو معلوم کریں۔ جب کسی فرد کو بیماری، پریشانی، یا
            مشکلات کا سامنا ہو، اور وہ مسلسل تدابیر آزمانے کے باوجود ان مسائل سے
            نجات نہ پا رہا ہو، تو اس صورت میں روحانی تشخیص بہت اہم ہو جاتی ہے۔
            روحانی تشخیص سے یہ جانچنا ضروری ہوتا ہے کہ آیا یہ مسائل کسی غیر
            روحانی اثرات کی وجہ سے تو نہیں ہو رہے، جیسے کہ سحر، جنات یا نظرِ بد۔
            اگر یہ اثرات موجود ہوں تو پھر ان کا علاج کیا جاتا ہے، اور ساتھ ہی
            ساتھ فرد یا جگہ کی حفاظت کے لیے ضروری تدابیر بھی جاری رکھی جاتی ہیں
            تاکہ مستقبل میں کسی بھی قسم کے روحانی حملے سے بچا جا سکے۔ یعنی،
            روحانی تشخیص کے بعد درست علاج کیا جانا چاہیے تاکہ فرد کی حالت بہتر
            ہو اور وہ خود سے اپنے مسائل کو سمجھ سکے۔
          </Text>
          <Text style={styles.description}>
            ادارہ روحانیات میں جس طریقے سے تشخیص کی جاتی ہے، اس کے چند فوائد درج
            ذیل ہیں:۔
          </Text>
          <Text style={styles.description}>
            گھر یا جگہ میں کس کس حصے میں جادو ، جنات یا دونوں کا اثر ہے؟
          </Text>
          <Text style={styles.description}>
            گھر یا جگہ میں کس کس حصے میں غیبی مخلوق کی رہائش ہے؟
          </Text>
          <Text style={styles.description}>
            مریض پر جادو ، جنات یا دونوں کا اثر ہے؟
          </Text>
          <Text style={styles.description}>
            مریض کے جسم کے کس حصے میں جادو، جنات یا دونوں کا اثر ہے؟
          </Text>
          <Text style={styles.description}>
            مریض پر کوئی غیبی مخلوق مسلط ہے یا صرف اثرات ہیں؟
          </Text>
        </View>
        <Text style={styles.subheading}>روحانی علاج </Text>
        <Text style={styles.description}>
          پریشانیوں، آفتوں، مصیبتوں، تکلیفوں، مشکلات میں گرفتار، خوشیوں سے نا
          امید، زندگی سے مایوس بے بس افراد کے لیے خوشخبری: نظر بد، جادو جنات، ہر
          طرح کی بندشیں، معاشی مسائل، شادی کے مسائل، زوجین کے مسائل،
          گھریلو/خاندانی مسائل، اولاد کے مسائل، جائیداد، عدالتی مسائل، دشمنی کے
          مسائل، تعلیمی مسائل، بیماریوں کا علاج، نفسیاتی مسائل، روحانی مسائل،
          پریشانیوں سے نجات، حاجات کا پورا ہونا۔
        </Text>
        <Text style={styles.subheading}> پریشانیوں اور بیماریوں کی وجوہات </Text>
        <Text style={styles.description}>
          مصیبت، مشکل، تکلیف، بیماری، پریشانی… الغرض کچھ بھی ہو، اس کی کوئی وجہ
          ضرور ہوتی ہے۔ اصل وجہ تو ’’گناہوں کی شامتِ اعمال‘‘ ہے جس پر بالکل
          دھیان نہیں دیا جاتا۔ دنیا بھر کا علاج کروانے کو ہم تیار ہیں، مگر اللہ
          کے سامنے حقیقی توبہ کرنے اور گناہوں کو چھوڑنے کو تیار نہیں۔ اس لئے ہر
          پریشان اور مصیبت زدہ و بیمار انسان کو چاہیے کہ جتنا ممکن ہو، گناہوں سے
          بچے اور حقیقی توبہ اور کثرت سے استغفار کو اپنا معمول بنائے۔ اللہ کو
          راضی کیے بغیر سلامتی اور عافیت والی زندگی ممکن نہیں ہے۔ اہلِ فن فرماتے
          ہیں کہ عمومًا پریشانیوں اور بیماریوں کی وجوہات چار ہوتی ہیں: (۱) نظر
          بد (۲) سحر و جادو (۳) جنات و شیاطین (۴) قدرتی۔ پہلی تین وجوہات کا تعلق
          ’’برے اثرات/بد اثرات‘‘ سے ہے۔ کسی سائل کی پریشانی کی وجہ ایک برا اثر
          ہوتا ہے، کسی کی دو اور کسی پر تینوں طرح کے برے اثرات ہوتے ہیں۔ روحانی
          تشخیص سے پہلی تین وجوہات کا پتہ لگایا جا سکتاہے۔ سب سے پہلے روحانی
          تشخیص کروائیں تاکہ تسلی ہو جائے کہ پہلی تین وجوہات میں سے کوئی موجود
          تو نہیں۔ اگر پہلی تین وجوہات میں سے کوئی بھی ہو تو اس کو دور کیے بغیر
          پریشانی سے مکمل نجات نہیں ملتی اور نہ بیماری سے مکمل شفا ملتی ہے۔
          خصوصًا جسمانی بیماریوں کے مریض علاج پر اپنا وقت اور پیسہ برباد کرتے
          ہیں لیکن شفا نہیں ہوتی اور کئی بار صحت مزید خراب ہو جاتی ہے۔ پھر
          روحانی علاج سے اثراتِ بد کو دور کرنے میں وقت لگتا ہے اور اس کے بعد
          جسمانی علاج پر دوبارہ وقت اور پیسہ خرچ ہوتا ہے۔ اس اصول کا مریضوں اور
          عاملین کی کثیر تعداد کو بہت تجربہ ہے۔ اگر پہلی تین وجوہات میں سے کوئی
          وجہ نہ ہو تو لازمی چوتھی وجہ ہوتی ہے۔ چوتھی وجہ ہو تو کسی اللہ والے
          عالم یا بزرگ سے رجوع کیا جائے۔ اللہ کو ناراض کرنے والے اعمال چھوڑ کر
          راضی کرنے کے اعمال کیے جائیں۔
        </Text>
        <Text style={styles.subheading}>
          ادارہ روحانیات میں روحانی علاج کرنے کے چار طریقے{" "}
        </Text>
        <Text style={styles.description}>
          ادارہ روحانیات میں چار طریقوں سے روحانی علاج کیا جاتا ہے۔ علاج کا کوئی
          بھی طریقہ ہو، وہ ایک دنیاوی تدبیر سے زیادہ کچھ نہیں ہوتا۔ نتیجہ صرف
          اور صرف اللہ تعالیٰ ہی مرتب فرماتے ہیں۔ یہ عقیدہ رکھنا کہ نتیجہ اللہ
          کے علاوہ کوئی مرتب کر سکتا ہے … یہ ’’شرک‘‘ ہے۔اس عقیدہ کی اصلاح کرنا
          لازم ہے۔ چاروں طریقوں کی تفصیل یہ ہے:۔
        </Text>
        <Text style={styles.subheading}>طریقہ اول</Text>
        <Text style={styles.description}>
          ادارہ روحانیات میں چار طریقوں سے روحانی علاج کیا جاتا ہے۔ علاج کا کوئی
          بھی طریقہ ہو، وہ ایک دنیاوی تدبیر سے زیادہ کچھ نہیں ہوتا۔ نتیجہ صرف
          اور صرف اللہ تعالیٰ ہی مرتب فرماتے ہیں۔ یہ عقیدہ رکھنا کہ نتیجہ اللہ
          کے علاوہ کوئی مرتب کر سکتا ہے … یہ ’’شرک‘‘ ہے۔ اس عقیدہ کی اصلاح کرنا
          لازم ہے۔ چاروں طریقوں کی تفصیل یہ ہے:۔
        </Text>
        <Text style={styles.subheading}>طریقہ دوم </Text>
        <Text style={styles.description}>
          {" "}
          اس طریقے میں روحانی معالجین سائل/ مریض کے حالات سننے کے بعد روحانی
          علاج دیتے ہیں جو وظائف اور تعویذات پر مشتمل ہو سکتا ہے۔ اس طریقے میں
          بھی محنت سائل/مریض کو ہی کرنی ہوتی ہے البتہ روحانی معالجین کی روحانی
          قوت غائبانہ طور پر سائل /مریض کی معاونت کرتی ہے اور ضرورت ہو تو دورانِ
          علاج مریض/سائل روحانی معالج سے مشاورت بھی کر سکتا ہے۔ اس کی مثال ایسی
          ہے کہ روحانی معالج سائل/مریض کو اپنا ہتھیار دیتا ہے۔ ہتھیار چلانا
          سائل/مریض کا کام ہے۔ جیسے کہا جائے، ویسے سائل/ مریض کو کرنا چاہیے تاکہ
          بھرپور فائدہ ہو۔ جو سائل/مریض علاج کیلئے مدرسہ تعلیم القرآن لاہور
          تشریف لاتے ہیں، ان کو ایک سے دو ہفتے کا علاج دیاجاتا ہے۔ سائل/مریض سے
          کوئی ھدیہ طلب نہیں کیا جاتا البتہ وہ اپنی مرضی سے جو ھدیہ دینا چاہے،
          دے سکتا ہے۔ البتہ اگر روحانی دکان کا تیار علاج دیا جائے یا اشیاء دی
          جائیں تو ان کی قیمت وصول کی جاتی ہے۔
        </Text>
        <Text style={styles.subheading}> طریقہ سوم </Text>
        <Text style={styles.description}>
          {" "}
          اس طریقے میں سائل؍مریض کو اس کے مسئلے کے مطابق کسی روحانی عمل کی اجازت
          دی جاتی ہے۔ اس عمل کے پیچھے غیبی مخلوق کو تاکید کی جاتی ہے کہ وہ مریض
          کے مسئلے کے حل کے لیے جتنا ممکن ہو، وہ تعاون کرے۔ عمل کو استعمال کرنے
          کے بارے میں سائل کی مکمل رہنمائی کی جاتی ہے۔ سائل صرف اپنی ذات اور گھر
          والوں کے لیے اس عمل سے فائدہ اٹھا سکتا ہے۔ عمل کی تجویز روحانی علاج
          گاہ کے روحانی معالجین کرتے ہیں۔ کسی عمل کا ھدیہ لیا جاتا ہے، کسی کا
          نہیں۔
        </Text>
        <Text style={styles.subheading}> طریقہ چہارم </Text>
        <Text style={styles.description}>
          {" "}
          اس طریقے میں روحانی معالجین علاج کے ساتھ ساتھ خود بھی سائل/ مریض کے
          لیے عمل کرتے ہیں۔ اس کی مثال ایسی ہے کہ روحانی معالج اپنے ہتھیاروں کے
          ساتھ سائل/مریض کے دشمن کا خود سامنا کرتا ہے اور سائل کو اپنے پیچھے کر
          دیتا ہے ۔ راتوں کو بیٹھ کر پڑھتا بھی ہے اور جیسی روحانی مدد کی ضرورت
          ہو، وہ بھی کرتا ہے۔ سائل/مریض اپنے روحانی معالج سے مکمل رابطے میں رہتا
          ہے۔ اور روزمرہ حالات کی اطلاع کرکے مشورہ لے سکتا ہے۔ اس طریقے میں کافی
          محنت کرنی پڑتی ہے، وقت لگتا ہے اور جنات جادو کے علاج میں عامل اور اس
          کے اہل و عیال کو خطرہ بھی ہوتا ہے۔ ادارہ روحانیات کے جس ’’روحانی
          معالج‘‘ سے آپ نے علاج کروانا ہے، معاملات بھی وہی طے کرے گا۔ ھدیہ کتنا
          ہوگا؟ کتنی مدت تک ’’روحانی معالج‘‘ مدد کرے گا؟ اور اس طرح کے تمام
          معاملات پہلے طے کریں۔ اس لیے بہتر ہے کہ پہلے استخارہ کرلیا جائے کہ
          روحانی علاج گاہ کے فلاں روحانی معالج سے علاج کراؤ ں یا نہیں؟ اگر مطمئن
          ہوں تو پھر رابطہ کریں۔ یاد رہے کہ تدبیر ہماری ہوگی مگر نتیجہ صرف اللہ
          تعالیٰ ہی مرتب فرماتے ہیں۔ رقم محنت کی لی جاتی ہے، نتیجے کی نہیں۔ جو
          بھی خرچہ ہوگا اور رقم وصول کی جائے گی، وہ نا قابلِ واپسی ہوگا۔
        </Text>
      </ScrollView>
    </CustomBackground>
  );
}

const styles = StyleSheet.create({
  heading: {
    fontSize: 40,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
    subheading: {
    fontSize: 30,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
  description: {
    fontSize: 20,
    color: "#6C472D",
    fontFamily: "Jameel-Noori-Regular",
    textAlign: "right",
    writingDirection: "rtl",
  },
});
