import { ScrollView, StyleSheet, Text, View } from "react-native";
import CustomBackground from "../../../components/Background/Background";
export default function MujarrabTareeqaRohaniIlaaj() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>ادرا روحانیت</Text>
          <Text style={styles.description}>
            ادارہ روحانیات 2001 میں قائم کیا گیا۔ ادارہ روحانیات کے تحت بہت سارے
            شعبہ جات میں کام کیا جارہا ہے۔ ادارے میں شعبہ روحانی و مخفی علوم کے
            زیر اہتمام پوری دنیا کے مختلف ممالک میں ہماری روحانی نگرانی اور
            رہنمائی میں کثیر تعداد میں طالبین علومِ روحانیات سیکھ رہے ہیں، اور
            باقاعدہ چلہ کشی کرکے سیکھنے کے بعد آگے مخلوق کی صحیح معنوں میں خدمت
            کر رہے ہیں۔ فللہ الحمد، ادارے کی طرف سے علاج کی سہولت موجود ہے اور
            الحمدللہ ہمارا ادارہ اللہ کے فضل و کرم سے بہت سے عاملین اور معالجین
            سے ممتاز حیثیت کا حامل ہے۔ ابتدا سے انتہا تک تمام منازل اپنی روحانی
            نگرانی میں طے کروائی جاتی ہیں۔ روحانی تشخیص کرنا، جادو اور جنات کا
            علاج کرنا، حب و بغض کے عملیات، جسمانی بیماریوں کا روحانی علاج،
            حصارات اور دفاع کے کثیر اعمال، دشمن سے نمٹنے اور نجات کے اعمال،
            انسانی اور جناتی جادوگروں سے مقابلہ کرنا، علم الاعداد، علم النقوش،
            علم الساعات اور بہت کچھ سکھایا جاتا ہے۔ جو لوگ چلہ کشی نہیں کر سکتے،
            ان کے لیے نقد صدقہ ادا کرکے سیکھنے کا بھی انتظام ہے۔ کئی اعمال ہیں
            جو نقد صدقہ ادا کرکے لیے جا سکتے ہیں۔ نیز، روحانی عاملین جو بنیادی
            درجہ حاصل کر چکے ہوں، ان کو بڑے بامؤکل اعمال بھی کروائے جاتے ہیں،
            اور کئی دوسرے اعمال جن کے پیچھے باقاعدہ مخلوق کام کرتی ہے، جو شرعاً
            جائز ہیں، بھی سکھائے جاتے ہیں جو تجربے میں بہت مفید ثابت ہوئے ہیں۔
            ہمارے ادارے میں مسلکی اختلافات سے بالاتر ہو کر روحانی علوم کی تعلیم
            دی جاتی ہے۔ آئیے، روحانی علوم سیکھ کر بلا تفریق مسلک انسانیت کی
            خدمت کیجئے۔ ہمارے روحانی اعمال کو پوری دنیا میں ہر کوئی کر سکتا ہے۔
            ہمارے اعمال کرنے سے کسی قسم کا کوئی خوف و خطرہ نہیں ہوتا اور نہ کسی
            قسم کی رجعت کا سامنا کرنا پڑتا ہے۔
          </Text>
          <Text style={styles.heading}>مزید شعبہ جات </Text>
          <Text style={styles.description}>
            روحانی دکان , تعویذات عثمانیہ , روحانی علاج گا ہ , روحانی تعویذات
            روحانی عملیات کورسز , مدرسہ تعلیم القرآن
          </Text>
          <Text style={styles.heading}>
            (ہم دعویٰ نہیں علاج کرتے ہیں) ہمارا طریقہ علاج
          </Text>
          <Text style={styles.description}>
            معالج روحانی امراض کا ہو یا جسمانی امراض کا، اس کے دل میں مریض کی
            خیر خواہی لازماً ہوتی ہے۔ چونکہ یہ علاج معالجہ ایک طرح سے کاروبار
            بھی ہے، تو عموماً ذہن کاروبار کی طرف ہی جاتا ہے، جس کی وجہ سے علاج
            میں خاطر خواہ کامیابی حاصل نہیں ہوتی۔ اور ایک اہم بات یہ بھی ہے کہ
            لوگ روحانی علاج معالجہ میں عموماً پیسہ خرچ کرنا اچھا نہیں سمجھتے،
            اور پیسے مانگنے والے معالجین کے بارے میں بھی نازیبا الفاظ کا استعمال
            کرتے ہیں، جس کی وجہ سے روحانی معالج بھی فقط اتنا ہی علاج کرتے ہیں کہ
            مریض کا مرض ہلکا ہو جائے اور معالج کی عظمت مریض کے دل میں بیٹھ جائے۔
            لیکن اس کے برعکس ہمارے ادارے کی خصوصیات میں سے ایک خاص بات یہ ہے کہ
            ہم پہلے مریض کو مرض کے بارے میں مکمل آگاہی دیتے ہیں کہ: یہ مرض ہے
            کیا؟ یہ مرض لگتا کیسے ہے؟ یہ مرض لگتا کیوں ہے؟ اس مرض سے مستقل
            چھٹکارا کیسے ممکن ہے؟ اور آئندہ کے لیے اس مرض سے مستقل حفاظت کیسے
            ممکن ہے؟
          </Text>
          <Text style={styles.description}>
            یہ بنیادی معلومات ہیں جن کا جاننا مریض اور اس کے اہل خانہ کے لیے
            نہایت ضروری ہے۔ یاد رہے کہ ہمارا طریقۂ علاج اکابرین کے مجرب اعمال
            اور عین اسلامی تعلیمات کے مطابق ہے۔ اس کے بعد علاج کی طرف متوجہ ہوتے
            ہیں اور علاج شروع کرتے ہیں، چونکہ علاج کرنے سے اللہ کے فضل و کرم سے
            مریض کا مرض یقینا ختم ہو جاتا ہے۔ اگر جنات مسلط ہوں تو ان کے ساتھ
            معاملات بات چیت کے ذریعے حل کیے جاتے ہیں، یا ان کو قید کر دیا جاتا
            ہے، ورنہ جلا دیا جاتا ہے۔ مگر اس کے باوجود یہ کیسے ممکن ہے کہ آئندہ
            حملہ نہیں ہوگا یا کوئی اور دشمن پیدا نہیں ہوگا؟ یہ سلسلہ تو زندگی کے
            ساتھ ساتھ چلتا رہتا ہے۔ اگر دوبارہ حملہ ہوگا تو مریض پھر اسی معالج
            کے پاس جائے گا یا کسی اور معالج کی طرف متوجہ ہو گا۔ بہرحال مریض کو
            دوبارہ علاج کروانا ہی پڑتا ہے۔ اللہ کے فضل و کرم سے اور اساتذہ کرام
            کے طریقۂ علاج کی وجہ سے ہم خود کو اس لیے باقی معالجین سے ممتاز
            سمجھتے ہیں۔ لہٰذا، اساتذہ کرام کے نقش قدم پر چلتے ہوئے بندہ علاج
            کرنے کے ساتھ ساتھ مریض کو ایک مضبوط ہتھیار، عمل کی صورت میں دے دیتا
            ہے۔ وہ اعمال، جن کی مدد سے بڑے بڑے عاملین اپنے مریضوں کا علاج اور
            کام کرواتے ہیں، اعمال کی برکت اور اللہ پاک کے فضل و کرم سے مریض اس
            قابل ہو جاتا ہے کہ آئندہ اگر کوئی جادو یا جنات کی طرف سے حملہ ہو یا
            کسی حاسد سے واسطہ پڑے تو کسی کے پاس نہ جانا پڑے، بلکہ وہ خود اس کا
            حل کرے۔ دشمن کو چھٹی کا دودھ یاد دلانا، اپنی، اپنے اہل خانہ اور
            کاروبار کی حفاظت کرنا، اور دشمن کو کیسے زیر کیا جاتا ہے — یہ سب کچھ
            مریض سیکھ جاتا ہے۔ جس کی وجہ سے، الحمدللہ، ہم بہت سی مخلوقات کی
            دعاؤں میں رہتے ہیں۔ یہ اعمال ہر کوئی کر سکتا ہے۔ اس میں کسی قسم کا
            کوئی پرہیز، ڈر یا خوف کا خطرہ نہیں ہوتا۔
          </Text>
          <Text style={styles.heading}>
            اعمال کے ذریعے مریض کا روحانی علاج{" "}
          </Text>
          <Text style={styles.description}>
            ادارہ روحانیات کے زیرِ تحت ہمارا طریقۂ علاج بالکل منفرد ہے۔ پوری
            دنیا میں جن مریضوں کا ہم علاج کرتے ہیں، ان کو حفاظت اور آئندہ اپنا
            علاج خود کرنے کے لیے جن اعمال کی اجازت دی جاتی ہے، ان کے ساتھ
            باقاعدہ مخلوق موجود ہوتی ہے۔ اس عمل کے جنات کے نیٹ ورک میں ان کا نام
            لکھوا دیا جاتا ہے۔ جن کی کسی روحانی مرض کی وجہ سے نظر کھلی ہوتی ہے،
            ان کو جنات نظر بھی آتے ہیں۔ اجازت یافتہ کا نام اس قبیلے میں درج
            کروایا جاتا ہے جو حضرت پیرانِ پیر شیخ عبد القادر جیلانی محبوب سبحانی
            قطب ربانی رحمۃ اللہ علیہ کے مریدوں میں سے ہیں۔ یہ قبیلے چونکہ
            انسانوں کی بھلائی کے لیے کام کرتے ہیں، بلکہ ان کے بچے اور خواتین بھی
            جادو و جنات کا علاج کرنے میں بہت ماہر ہوتے ہیں۔ اس عمل کی اجازت دینے
            کے بعد مریضوں کو ان کے نقوش کی اجازت اور طریقہ بھی بتا دیتے ہیں تاکہ
            آئندہ زندگی میں ان کو کسی عامل کے پاس نہ جانا پڑے۔ جادو کے علاج کے
            ساتھ ساتھ حفاظت کے اعمال ضروری ہوتے ہیں تاکہ ان پر کوئی حملہ نہ کر
            سکے۔ ان کو وہ بھی سکھائے جاتے ہیں تاکہ مریض اپنے گھر، کاروبار، اہل و
            عیال اور اپنی حفاظت کر سکے۔ خاص بات: ضرورت پڑنے پر جنات سے کیسے کام
            لینا ہے؟ اور دشمن کو کیسے مزہ چکھانا ہے؟ کوئی بیماری یا ایسا مسئلہ آ
            جائے جس کی سمجھ نہ آ رہی ہو تو اس کی روحانی تشخیص کیسے کی جاتی ہے؟
            اہلِ خانہ، دکان، کاروباری جگہ، فیکٹری، گودام اور گھر وغیرہ کی تشخیص
            و علاج — سب کچھ سکھایا جاتا ہے۔ الحمدللہ، پوری دنیا میں ہمارا ادارہ
            سوشل میڈیا پر بہت سی کتب، موبائل اپلیکیشنز، ویڈیوز، ویب سائٹ اور
            روزانہ مختلف پوسٹس کے ذریعے مفت انسانیت کی خدمت میں مصروف ہے۔ اور
            مخلوقِ خدا فیض یاب ہو رہی ہے۔ الحمدللہ، ہم ان کی دعاؤں میں ہیں۔ اور
            مجبور و لاچار کے دل سے نکلی ہوئی دعا ہی ہمارے لیے سرمایۂ حیات ہے —
            اور یہی ہماری ترقی کا راز بھی ہے۔
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}
const styles = StyleSheet.create({
 heading: {
    fontSize: 40,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
    lineHeight:100,
  },
  subheading: {
    fontSize: 30,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
    lineHeight:80,
  },
  description: {
    fontSize: 20,
    color: "#6C472D",
    fontFamily: "Jameel-Noori-Regular",
    textAlign: "right",
    writingDirection: "rtl",
  },
});
