import { ScrollView, StyleSheet, Text, View } from "react-native";
import CustomBackground from "../../../components/Background/Background";

export default function NakoshLawazmat() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>نقوش کا مزاج اور طریقہ زکات</Text>
          <Text style={styles.description}>
            نقوش کئی طرح سے لکھے جاتے ہیں اور کئی اشیاء مثلاً مختلف دھاتوں،
            جانوروں کی کھالوں اور ہڈیوں پر، کئی طرح کے کاغذوں پر اور کئی طرح کے
            کپڑوں پر لکھے جاتے ہیں۔ ہر مقصد کیلئے نقش لکھنے اور استعمال کا طریقہ
            علیحدہ ہوتا ہے، جیسے عملیات کا مزاج ہوتا ہے ویسے ہی نقوش کا بھی مزاج
            ہوتا ہے۔ نقش لکھنے کیلئے اس کے اصول و قواعد کا خاص خیال رکھنا نہایت
            ضروری ہوتا ہے۔ اسی طرح وقت، سمت، قلم، سیاہی کے رنگ، جگہ اور مقام کا
            خیال بھی رکھا جاتا ہے۔ ہر نقش کی علیحدہ دھونی (خوشبو) ہوتی ہے۔ نقوش
            ہر قسم کے مسائل کیلئے لکھے اور استعمال کئے جاتے ہیں۔ جادو کیا بھی
            جاتا ہے۔ مثبت اور منفی، خیر اور شر کیلئے یہ عامل پر منحصر ہوتا ہے۔
            وہ عامل نقوش کے قواعد و ضوابط کا خیال نہیں رکھتے جنہوں نے جناتی چلے
            کئے ہوتے ہیں اور جنات سے کام لینا جانتے
          </Text>
          <Text style={styles.subheading}>
            نقوش طبیت کے اعتبار سے چار طرح کے ہوتے ہیں
          </Text>
          <View style={styles.list}>
            <Text style={styles.item}>• آتشی</Text>
            <Text style={styles.item}>• بادی</Text>
            <Text style={styles.item}>• آبی</Text>
            <Text style={styles.item}>• خاکی</Text>
          </View>
<Text style={styles.subheading}>1. آتشی نقوش (برائے زکات آگ میں جلائے جاتے ہیں۔)</Text>
<Text style={styles.description}>استعمال کیلئے گلے میں ڈالے جاتے ہیں، بازو پر باندھے جاتے ہیں، آگ میں ڈالے جاتے ہیں یا آگے کے نیچے دفن کئے جاتے ہیں اس طرح کی ان کو مسلسل حرارت پہنچتی رہے۔ یہ نقش سعد اور مثبت اعمال میں اچھی چیزوں پر لکھے جاتے ہیں، مثلاََ کاغذ، ہرن کی چھلی یا کھال، چینی کی پلیٹ، سونے چاندی کی لوح وغیرہ پر، نحس اور منفی اعمال میں کتے کی ہڈی یا کھال، گدھے کی کھال، الو کی کھال سرخ یا کالے کاغذ پر آتشی نقش لکھتے وقت عامل کو چاہیے کہ اپنا رخ مشرق کی طرف کرے، اپنے قریب آگ جلا لے اور ایک زانو ہو کر لکھے۔</Text>

<Text style={styles.subheading}>2. بادی نقوش (برائے زکات درخت پر لٹکائے جاتے ہیں)</Text>
<Text style={styles.description}>استعمال گلے میں ڈالے جاتے ہیں، بازو پر باندھے جاتے ہیں اور درختوں پر لٹکائے جاتے ہیں۔ اچھے کاموں کیلئے مثلاََ محبت، ترقی، ملازمت وغیرہ کیلئے سبز کپڑے میں پیک کر کے کسی بھی میٹھے پھل دار درخت پر لٹکائے جاتے ہیں، برے اور منفی کاموں کیلئے مثلاََ نفرت، عداوت، زبان بندی وغیرہ کیلئے کالے کپڑے میں پیک کر کانٹے دار یا کڑوے درخت کے ساتھ باندھے جاتے ہیں۔ بادی نقش لکھتے وقت عامل کسی اونچی جگہ پر بیٹھے مثلاََ تخت، بیڈ، کرسی وغیرہ، منہ مغرب کی جانب رکھے اور دو زانو ہو کر لکھے۔</Text>

<Text style={styles.subheading}>3. خاکی نقوش (برائے زکات زمین میں دبائے جاتے ہیں)</Text>
<Text style={styles.description}>استعمال گلے میں ڈالے جاتے ہیں، بازو پر باندھے جاتے ہیں اور درختوں پر لٹکائے جاتے ہیں، زمین میں دبائے جاتے ہیں یا بھاری پتھر کے نیچے رکھے جاتے ہیں۔ اچھے اور مثبت کاموں کیلئے نقوش خاکی کپڑے میں پیک کر کے صاف ستھری زمین یعنی مسجد، دربار یا کھیتوں میں دفن کئے جاتے ہیں۔ برے اور منفی کاموں کیلئے قبرستان، مردہ گھاٹ یا کسی کندے مقام پر دفن کئے جاتے ہیں، خاکی نقش لکھتے وقت عامل مکمل تنہا ہو کچی زمین پر بیٹھ کر لکھے، جنوب کی جانب منہ ہو اور آلتی پالتی مار کر بیٹھے۔</Text>

<Text style={styles.subheading}>4. آبی نقوش (برائے زکات آٹے کی گولی نقش ڈال کر دریا میں ڈالیں)</Text>
<Text style={styles.description}>استعمال گلے میں ڈالے جاتے ہیں، بازو پر باندھے جاتے ہیں، مریض یا مطلوب کو پانی میں گھول کر پلائے جاتے ہیں یا آٹے کی گولیاں بنا کر دریا میں ڈالتے ہیں۔ دریا یا سمندر کے کنارے دفن کئے جاتے ہیں تاکہ نقش کو نمی ملتی رہے، اچھے اور مثبت کاموں کیلئے سمندر، تالاب، ندی یا نہر وغیرہ میں ڈالے جاتے ہیں، منفی کاموں کیلئے گندے پانی میں ڈالے جاتے ہیں۔ آبی تعویز لکھتے وقت عامل کے پاس پانی سے بھرا طشت رکھا ہو، ایک ٹانگ بچھا کر لکھے، منہ شمال کی طرف رکھے۔</Text>

        </View>
      </ScrollView>
    </CustomBackground>
  );
}

const styles = StyleSheet.create({
  heading: {
    fontSize: 40,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
  subheading: {
    fontSize: 30,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
  description: {
    fontSize: 20,
    color: "#6C472D",
    fontFamily: "Jameel-Noori-Regular",
    textAlign: "right",
    writingDirection: "rtl",
  },
  list: {
    paddingRight: 10,
  },
  listContainer: {
    flexDirection: "row",
    justifyContent: "space-between",
  },
  column: {
    flex: 1,
    paddingRight: 10,
  },
  item: {
    fontSize: 20,
    color: "#6C472D",
    fontFamily: "Jameel-Noori-Regular",
    textAlign: "right",
  },
});
