import { View, Text, StyleSheet, ScrollView } from "react-native";
import CustomBackground from "../../../../../components/Background/Background";
import HTMLView from "react-native-htmlview";
export default function IdaraRohaniyatScreen() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>ادرا روحانیت</Text>
          <Text style={styles.description}>
            ادارہ روحانیات 2001 میں قائم کیا گیا۔ ادارہ روحانیات کے تحت بہت سارے
            شعبہ جات میں کام کیا جارہا ہے ۔ ادارے میں شعبہ روحانی و مخفی علوم کے
            زیر اہتمام پوری دنیا کے مختلف ممالک میں ہماری روحانی نگرانی اور
            رہنمائی میں کثیر تعداد میں طالبین علوم روحانیات سیکھ رہے ہیں اور
            باقاعدہ چلہ کشی کر کےسیکھنے کے بعد آگے مخلوق کی صحیح معنوں میں خدمت
            کر رہے ہیں ۔فللہ الحمدادارے کی طرف سے علاج کی سہولت موجود ہے اور
            الحمدللہ ہمارا ادارہ اللہ کے فضل و کرم سے بہت سے عاملین اور معالجین
            سے ممتاز حثیت کا حامل ہے۔ابتدا سے انتہا تک تمام منازل اپنی روحانی
            نگرانی میں طے کروائی جاتی ہیں۔ روحانی تشخیص کرنا، جادو اور جنات کا
            علاج کرنا، حب و بغض کے عملیات، جسمانی بیماریوں کا روحانی علاج،
            حصارات اور دفاع کے کثیر اعمال، دشمن سے نمٹنے اور نجات کے اعمال،
            انسانی اور جناتی جادوگروں سے مقابلہ کرنا، علم الاعداد، علم النقوش،
            علم الساعات اور بہت کچھ سکھایا جاتا ہے۔ جو لوگ چلہ کشی نہیں کر سکتے،
            ان کے لئے نقد صدقہ ادا کرکےسیکھنے کا بھی انتظام ہے۔ کئی اعمال ہیں جو
            نقد صدقہ ادا کرکے لئے جا سکتے ہیں۔ نیز روحانی عاملین جو بنیادی درجہ
            حاصل کر چکے ہوں، ان کو بڑے بامؤکل اعمال بھی کروائے جاتے ہیں۔ اور
            کئی دوسرے اعمال جن اعمال کے پیچھے باقاعدہ مخلوق کام کرتی ہے جو شرعاً
            جائز ہیں، بھی سکھائے جاتے ہیں جو تجربے میں بہت مفید ثابت ہوئے ہیں۔
            ہمارے ادارے میں مسلکی اختلافات سے بالاتر ہو کر روحانی علوم کی تعلیم
            دی جاتی ہے۔ آئیے، روحانی علوم کی سیکھ کر بلا تفریق مسلک، انسانیت کی
            خدمت کیجئے۔ ہمارے روحانی اعمال کو ہر پوری دنیا میں ہر کوئی کر سکتا
            ہے ۔ ہمارے اعمال کرنے سے کسی قسم کا کوئی خوف و خطرہ نہیں ہوتا اور نہ
            کسی قسم کی رجعت کا سامنا کرنا پڑتا ہے۔
          </Text>
          <Text style={styles.heading}>مزید شعبہ جات </Text>
          <Text style={styles.description}>
            روحانی دکان , تعویذات عثمانیہ , روحانی علاج گا ہ , روحانی تعویذات
            روحانی عملیات کورسز , مدرسہ تعلیم القرآن
          </Text>
          <Text style={styles.heading}>
            ہمارا طریقہ علاج (ہم دعویٰ نہیں علاج کرتے ہیں)
          </Text>
          <Text style={styles.description}>
            معالج روحانی امراض کا ہو یا جسمانی امراض کااسکے دل میں مریض کی خیر
            خواہی لازماََ ہوتی ہے۔ چونکہ یہ علاج معالجہ ایک طرح سے کاروبار بھی
            ہےتو عموماََ ذہن کاروبار کی طرف ہی جاتاہے ۔جسکی وجہ سے علاج میں خاطر
            خواہ کامیابی حاصل نہیں ہوتی۔اور ایک اہم بات یہ بھی ہے کہ لوگ روحانی
            علاج معالجہ میں عموماََ پیسہ خرچ کرنا اچھا نہیں سمجھتے اور پیسے
            مانگنے والے معالجین کے بارے میں بھی نازیبا الفاظ کا استعمال کرتے ہیں
            جسکی وجہ سے روحانی معالج بھی فقط اتنا ہی علاج کرتے ہیں کہ مریض کا
            مرض ہلکا ہو جائےاور معالج کی عظمت مریض کے دل میں بیٹھ جائے ۔لیکن
            اسکے بر عکس ہمارے ادارہ کی خصوصیات میں سےایک خاص بات یہ ہےکہ ہم پہلے
            مریض کو مرض کےبارے میں مکمل آگاہی دیتے ہیں کہ یہ مرض ہے کیا۔؟ یہ
            مرض لگتاکیسے ہے؟ یہ مرض لگتا کیوں ہے ؟ اس مرض سےمستقل چھٹکارا کیسے
            ممکن ہے۔؟آئندہ کیلئے اس مرض سے مستقل حفاظت کیسے ممکن ہے ؟
          </Text>
          <Text style={styles.description}>
            یہ بنیادی معلومات ہیں جن کا جاننا مریض اور اس کے اہل خانہ کیلئے
            نہائت ہی ضروری ہے۔یاد رہے کہ ہمارا طریقہ علاج اکابرین کے مجرب اعمال
            اور عین اسلامی تعلیمات کے مطابق ہے۔اسکے بعد علاج کی طرف متوجہ ہوتے
            ہیں۔اور علاج شروع کرتے ہیں چونکہ علاج کرنے سےاللہ کے فضل و کرم
            سےمریض کا مرض یقیناََ ختم ہو جاتا ہے۔اگر جنات مسلط ہوں توان کےساتھ
            معاملات بات چیت کے ذریعے حل کئے جاتے ہیں۔ یا ان کو قید کر دیا جاتا
            ہے۔ ورنہ جلا دیا جاتا ہے۔ مگر اس کے باوجود یہ کیسے ممکن ہے کہ آئندہ
            حملہ نہیں ہوگا یا کوئی اور دشمن پیدا نہیں ہو گا۔یہ سلسلہ تو زندگی کے
            ساتھ ساتھ چلتا رہتا ہے ۔اگر دوبارہ حملہ ہو گا ۔تو مریض پھر اسی معالج
            کے پاس جائے گا یا کسی اور معالج کی طرف متوجہ ہو گا۔بہر حال مریض کو
            دوبارہ علاج کروانا ہی پڑتا ہے۔اللہ کے فضل و کرم سے اور اساتذہ کرام
            کے طریقہ علاج کی وجہ ہم خود کو اس لئےباقی معالجین سے ممتاز سمجھتے
            ہیں۔لہذا اساتذہ کرام کے نقش قدم پر چلتے ہو بندہ علاج کرنے کے ساتھ
            ساتھ مریض کو مضبوط ہتھیار عمل کی صورت میں دے دیتاہے۔وہ اعمال جن کی
            مدد سے بڑے بڑے عاملین اپنے مریض کا علاج اور کام کرواتے ہیں ۔اعمال کی
            برکت اور اللہ پاک کے فضل و کرم سے مریض اس قابل ہو جاتا ہے ۔ کہ
            آئندہ اگرکوئی جادویا جنات کی طرف سے حملہ ہو یاکسی حاسد کےپالا پڑےگا
            تو کسی کے پاس نہ جانا پڑےبلکہ اس کا خود حل کریں،دشمن کو چھٹی کا دودھ
            یاد کروا نا،اپنی، اپنے اہل خانہ اور اپنے کاروبار کی حفاظت کرنا، اور
            دشمن کو کیسے زیر کیا جاتا ہے اور یہ سب کچھ مریض اللہ کے فضل و کرم سے
            سیکھ جاتا ہے۔جسکی وجہ سےالحمداللہ ہم بہت سی مخلوقات کی دعاؤں میں
            رہتے ہیں۔یہ اعمال ہر کوئی کر سکتا ہے اس میں کسی قسم کا کوئی پرہیز یا
            ڈر ، خوف کا کوئی خطرہ نہیں ہوتا ۔
          </Text>
          <Text style={styles.heading}>
            اعمال کے ذریعے مریض کا روحانی علاج{" "}
          </Text>
          <Text style={styles.description}>
            ادراہ روحانیات کے زیر تحت ہمارا طریقہ علاج بالکل منفرد ہے ۔پوری دنیا
            میں جن مریضوں کا ہم علاج کرتے ہیں ان کو حفاظت اور آئندہ اپنا علاج
            خود کرنے کیلئے جن اعمال کی اجازت دی جاتی ہے ان کے ساتھ باقاعدہ مخلوق
            موجود ہوتی ہے ۔اس عمل کے جنات کے نیٹورک میں ان کا نام لکھوادیا جاتا
            ہے۔جن کی کسی روحانی مرض کی وجہ سے نظر کھلی ہوتی ہے ان کو جنات نظر
            بھی آتے ہیں۔اجازت یافتہ کا نام اس قبیلے میں درج کروایا جاتا ہے جو
            حضرت پیران پیر شیخ عبد القادر جیلانی محبوب سبحانی قطب ربانی رحمۃ
            اللہ علیہ کے مریدوں میں سے ہیں ۔یہ قبیلے چونکہ انسانوں کی بھلائی
            کیلئے کام کرتے ہیں بلکہ ان کے بچے اور خواتین بھی جادو جنات کا علاج
            کرنے میں بہت ماہر ہوتے ہیں، اس عمل کی اجازت دینے کے بعد مریضوں کو ان
            کے نقوش کی اجازت اور طریقہ بھی بتا دیتے ہیں تاکہ آئندہ زندگی میں ان
            کو کسی عامل کے پاس نہ جانا پڑے ۔جادو کے علاج کے ساتھ ساتھ حفاظت کے
            اعمال ضروری ہوتے ہیں تاکہ ان پر کوئی حملہ نہ کر سکے ان کووہ بھی
            سیکھائے جاتے ہیں تا کہ مریض اپنے گھر، کاروبار، اہل و عیال اور اپنی
            حفاظت کر سکے۔۔خاص بات۔ضرورت پڑنے پرجنات سے کیسے کام لینا ہے؟اور دشمن
            کو کیسے مزہ چکھانا ہے ۔کوئی بیماری یا کوئی ایسا مسئلہ آجائے جس کی
            سمجھ نہ آ رہی ہوتو اس کی روحانی تشخیص کیسے کی جاتی ہے۔؟اہل خانہ،
            دکان، کاروباری جگہ، فیکٹری، گودام اور گھر وغیرہ کی تشخیص و علاج سب
            کچھ سکھا یا جاتا ہے۔الحمد للہ پوری دنیا میں ہمارا ادار سوشل
            میڈیاپربہت سی کتب ، موبائل اپلیکیشن ، ویڈیوز، ویب سائٹ اورروزانہ
            مختلف پوسٹ کے ذریعے مفت انسانیت کی خدمت میں مصروف ہیں۔اور مخلوق خدا
            فیض یاب ہورہی ہے۔۔ الحمد للہ ہم ان کی دعاوں میں ہیں ۔۔اور مجبور
            ولاچار کے دل سے نکلی ہوئی دعا ہی ہمارے لئے سرمایہ حیات ہے۔اور یہی
            ہماری ترقی کا راز بھی ہے۔{" "}
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}
const styles = StyleSheet.create({
  heading: {
    fontSize: 25,
    fontFamily: "NotoNastaliqUrdu-Regular",
    lineHeight: 50,
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
    marginTop: 16,
  },
  description: {
    marginTop: 10,
    fontSize: 16,
    fontFamily: "NotoNastaliqUrdu-Regular",
    color: "#6C472D",
    lineHeight: 30,
    textAlign: "right",
    writingDirection: "rtl",
  },
});
