import { View, Text, StyleSheet, ScrollView } from "react-native";
import CustomBackground from "../../../../../components/Background/Background";

export default function RohaniIshayaScreen() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>روحانی اشیاء</Text>
          <Text style={styles.description}>
            ادارہ روحانیات کے زیر تحت روحانی دکان روحانی علاج کرنے والے عاملین
            کے ساتھ ساتھ روحانی مریضوں اور روحانی علوم سیکھنےوالےطالب علموں کے
            لئے قائم کی گئی ہے تاکہ روحانی علاج معالجہ، روحانی تجربات کرنے کے
            لئے جن اشیاء کی ضرورت پڑتی ہے، وہ ایک جگہ باآسانی مناسب قیمت پر
            دستیاب ہو سکیں۔ مختلف مقاصد کے لئے مختلف تعویذات (چھپے ہوئے اور ہاتھ
            کے لکھے ہوئے) دستیاب ہیں جو کئی سالوں سے روحانی معالجین اعتماد سے
            اپنے مریضوں کو استعمال کروا رہے ہیں۔ روحانی مریضوں اور روحانی
            معالجین کے لیے مختلف مقاصد کے لیے تیار روحانی علاج اور روحانی مجربات
            بھی موجود ہیں۔ منتخب کریں اور اعتماد سے استعمال کرکے فائدہ اٹھائیں۔
            عاملین اپنے مریضوں کو اعتماد سے استعمال کروا سکتے ہیں۔ ادارہ یہ
            سہولت بھی دیتا ہے کہ اگر کسی سائل/مریض یا کسی عامل کو کوئی خاص علاج
            تیار کروانا ہو، تعویذات لکھوانے ہوں، کوئی خاص کلام کے تعویذات زیادہ
            تعداد میں تیار کروانے ہوں، کسی خاص وقت یا اوقات میں تعویذات یا الواح
            تیار کروانی ہوں، تو ان کے لئے بھی انتظام موجود ہے۔ بہت احتیاط اور
            توجہ سے مطلوبہ کام کیا جاتا ہے۔ تعویذات عام کالی سیاہی، خاص کالی
            سیاہی، دیسی کالی سیاہی، زعفرانی سیاہی، مشک و زعفران کی سیاہی اور مشک
            و زعفران و عنبرکی سیاہی سے بھی لکھےجاتے ہیں۔ اسی طرح کوئی سورت یا
            خاص کلام خاص تعداد میں پانی یا تیل پر دم کروا کر دینے کی بھی سہولت
            موجود ہے۔
          </Text>
          <Text style={styles.heading}>روحانی دکان میں 2 شعبے ہیں</Text>
          <Text style={styles.description}>دم شدہ اشیاء</Text>
          <Text style={styles.description}>تیار روحانی علاج</Text>
          <Text style={styles.description}>
            سب کی تفصیل ذیل میں دی گئی ہے۔گھر بیٹھے تمام اشیاء منگوائیں۔ ڈاک خرچ
            بذمہ خریدار۔ پیشگی رقم کے بغیر اشیاء نہیں بھیجیں جائیں گی۔
          </Text>
          <Text style={styles.heading}>
            مریض اور معالجین کیلئے دم شدہ روحانی اشیاء
          </Text>
          <Text style={styles.description}>
            ادارہ روحانیات کے زیر تحت روحانی دکان کی خصوصیت ایسی اشیاء ہیں جن پر
            مختلف مقاصد کے لئے مختلف دم کیے گئے ہیں۔ اور تجربے میں بہت مفید ثابت
            ہوئی ہیں۔ ان تمام روحانی اشیاء پرپہلےعاملین دم کرتے ہیں، پھر
            استادمحترم خود دم کرتے ہیں۔ اس کے بعد جنات سے دم کروایا جاتا ہے۔ یہ
            اشیاء عوام کے ساتھ ساتھ عاملین کے لئے بہت کارآمد اور آسانی کا
            ذریعہ ہیں تاکہ عامل حضرات بآسانی یہ اشیاء مریضوں کو استعمال کروا
            سکیں۔ آج کے دور میں وقت کی کمی اور برکت نہ ہونے کی وجہ سے دوسرے
            افراد کی طرح روحانی معالجین کو بھی مشکل پیش آتی ہے کہ کہ کس طرح کم
            وقت میں زیادہ علاج تیار کیا جائے؟ پھر افرادی قوت کی کمی بھی ایک بہت
            بڑا مسئلہ ہے۔ ان مسائل کومد نظر رکھتے ہوئے کئی طرح کی روحانی اشیاء
            تیار کی گئی ہیں۔آرڈر کی تکمیل کے وقت جو قیمت ہوگی، وہی تصور کی جائے
            گی۔ تمام اشیاء گھر بیٹھے منگوا سکتے ہیں۔
          </Text>
          <Text style={styles.description}>
            الشفاء, اگر بتی , الشفاء پانی , الشفاء تیل , الشفاء شہد , الشفاء عطر
            , الشفاء باخور , الشفاء پرفیوم سپرے , الشفاء دھونی , الشفاء گوگل ,
            الشفاء ہرمل , الشفاء لوبان ,الشفاء صابن , الشفاء مہندی , الشفاء ابٹن
            , الشفاء چھلہ ,الشفاء کڑا , الشفاء دھاگہ , الشفاء ڈوری , الشفاء گنڈا
            , الشفاء چراغ الشفاء موم بتی, الشفاء مٹی , الشفاء راکھ , الشفاء کیل
            , الشفاء مرچیں , الشفاء چینی , الشفاء نمک , الشفاء پھکی, الشفاء شکر
            , الشفاء عرق گلاب , الشفاء چھوہارے , الشفاء کلونجی{" "}
          </Text>
          <Text style={styles.description}>
            جس طرح ایک میڈیکل سٹور میں تیار دوائی ملتی ہیں، اسی طرح ہمارے ادارے
            نے تیار روحانی علاج بنائے جاتے ہیں۔ یہ علاج مریضوں پر کامیاب تجربات
            کے بعد منظرِ عام پر لائے گئے ہیں۔ مریضوں کے ساتھ ساتھ روحانی معالجین
            بھی اعتماد سے استعمال کروا سکتے ہیں۔ علاج کی مکمل تفصیل، پرہیز اور
            طریقۂ استعمال کا پرچہ ہمراہ ہوتا ہے۔ دورانِ علاج کسی بھی قسم کی
            علاج سے متعلق پریشانی ہو تو مکمل رہنمائی کی جاتی ہے۔
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}

const styles = StyleSheet.create({
  heading: {
    fontSize: 25,
    lineHeight: 50,
    fontFamily: "NotoNastaliqUrdu-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
  description: {
    marginTop: 10,
    fontSize: 16,
    color: "#6C472D",
    lineHeight: 30,
    fontFamily: "NotoNastaliqUrdu-Regular",
    textAlign: "right",
    writingDirection: "rtl",
  },
});
