import { View, Text, StyleSheet, ScrollView } from "react-native";
import CustomBackground from "../../../../../components/Background/Background";

export default function RohaniIlajScreen() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>روحانی علاج کا مختصر تعارف </Text>
          <Text style={styles.description}>
            ادارہ روحانیات کے شعبہ روحانی کی بنیاد 2001 میںاپنے اساتذہ کی دعاؤں
            اور سرپرستی میں رکھی گئی۔ الحمدللہ 2001 سے یہ شعبہ تاحال بلا تفریق
            مذھب و مسلک، عوام کی خدمت میں مصروف ہے۔ کئی عاملین اور روحانی
            معالجین اس شعبے میں اپنی خدمات انجام دے چکے ہیں اور دے رہے
            ہیں۔الحمدللہ!ایک کثیر تعداد میں اندرون اور بیرون ملک سائلین اور
            روحانی مریض فیض یاب ہو چکے ہیں۔
          </Text>
          <Text style={styles.description}>
            نظرِبد، جادو اور جنات کے متاثرہ مریضوں کا روحانی علاج، ہر قسم کی
            مصیبتوں و پریشانیوں سے نجات، روحانی و جسمانی بیماریوں سے شفاء، جائز
            مقاصد کے حصول اور حاجتوں کے پورا ہونے کے لیے زود اثر اور تیر بہدف
            قرآن کریم، حد یث نبوی صلی اللہ علیہ و آلہ وسلم، بزرگانِ دین،
            علمائے کرام اور ماہرین فنِ عملیات کے مستند، انمول و مجرب عملیات و
            تعویذات کو بروئے کار لاتے ہوئے روحانی رہنمائی اور روحانی علاج کیا
            جاتا ہے۔
          </Text>
          <Text style={styles.description}>
            نظرِبد، جادو اور جنات کے متاثرہ مریضوں کی روحانی علاج کے ساتھ ساتھ
            مکمل رہنمائی بھی کی جاتی ہے تاکہ آئندہ مبتلا نہ ہوں۔ ان کو حفاظت کے
            خاص طریقے بتائے اور سکھائے جاتے ہیں ۔ جہاں ضرورت محسوس ہو، مریضوں کو
            حفاظتی اعمال کی چلہ کشی کروائی جاتی ہے۔سالہا سال سے جنات اور جادو کی
            اذیت میں مبتلا، سحرِ مسلسل (مسلسل جادو) کےمریضوں کو روحانی اعمال کی
            اجازت دی جاتی ہے اور چلہ کشی بھی کروائی جاتی ہے تاکہ وہ اس قابل ہوں
            کہ آئندہ خودسے اپنا اور اپنے اہل و عیال کا روحانی علاج کر سکیں۔
          </Text>
          <Text style={styles.heading}>
            تشخیص کی ضرورت اور عاملین اور عوام کی غفلت
          </Text>
          <Text style={styles.description}>
            روحانی معالجین کی بھی بہت بڑی غلطی ہے کہ وہ روحانی علاج تو شروع کر
            دیتے ہیں مگر تشخیص پر توجہ نہیں دیتے۔ اسی طرح عوام کا حال ہے کہ وہ
            وظائف؍علاج تو شروع کر دیتے ہیں مگر تشخیص نہیں کرواتے۔ یاد رکھیں!
            صحیح تشخیص ہو گی تو صحیح علاج بھی ہوگا۔ روحانی علاج یا وظائف کرنا
            ایسا ہی ہے جیسے کسی بیماری کے لیے دوا استعمال کی جائے۔ اگر بیماری کی
            تشخیص ہی نہیں تو پھر دوا لینا کہاں کی عقلمندی ہے؟ بغیر تشخیص کے کبھی
            کوئی دوا، کبھی کوئی دوا لینے سے شفاء ہونا تو درکنار، شفاء کا راستہ
            ہی بند ہو جاتا ہے۔ پھر کوئی صحیح دوا بھی اثر نہیں کرتی۔ یہی حال پھر
            روحانی علاج میں بھی ہوتا ہے۔ بغیر تشخیص کے قسم قسم کے علاج کروا کر
            کیس کو اتنا بگاڑ لیتے ہیں کہ کیس کو سنبھالنے کے لیے بہت وقت اور بہت
            محنت درکار ہوتی ہے۔
          </Text>

          <Text style={styles.heading}>روحانی تشخیص کا تعارف</Text>
          <Text style={styles.description}>
            روحانی تشخیص سے مراد یہ ہے کہ کسی بھی انسان یا جگہ کے بارے میں معلوم
            کیا جائے کہ اس پر سحر، جنات و آسیب یا نظرِ بد کا اثر ہے یا نہیں؟
            عمومًا روحانی تشخیص کی ضرورت اس وقت پڑتی ہے جب کسی بیماری، پریشانی،
            مصیبت سے نجات کے لیے تدابیر مسلسل ناکام ہو رہی ہوں۔ اس وقت ضروری
            ہوتا ہے کہ مزید تدبیریں کرنے کی بجائے یہ معلوم کیا جائے کہ کہیں سحر،
            جنات یا نظرِ بد کا اثر ہو نہیں؟ اگر ہو تو پھر اس کا علاج کیا جائے
            اور ساتھ ساتھ اپنی تدابیر جاری رکھی جائیں۔
          </Text>
          <Text style={styles.description}>
            ادارہ روحانیات میں جس طریقے سے تشخیص کی جاتی ہے، اس کے چند فوائد درج
            ذیل ہیں:۔
          </Text>
          <Text style={styles.description}>
            گھر یا جگہ میں کس کس حصے میں جادو ، جنات یا دونوں کا اثر ہے؟
          </Text>
          <Text style={styles.description}>
            گھر یا جگہ میں کس کس حصے میں غیبی مخلوق کی رہائش ہے؟
          </Text>
          <Text style={styles.description}>
            مریض پر جادو ، جنات یا دونوں کا اثر ہے؟
          </Text>
          <Text style={styles.description}>
            مریض کے جسم کے کس حصے میں جادو، جنات یا دونوں کا اثر ہے؟
          </Text>
          <Text style={styles.description}>
            مریض پر کوئی غیبی مخلوق مسلط ہے یا صرف اثرات ہیں؟
          </Text>
        </View>

        <Text style={styles.heading}>روحانی علاج </Text>
        <Text style={styles.description}>
          پریشانیوں، آفتوں، مصیبتوں، تکلیفوں ، مشکلات میں گرفتار، خوشیوں سے نا
          امید، زندگی سے مایوس بے بس افراد کے لیے خوشخبری نظر بد، جادو جنات , ہر
          طرح کی بندشیں ,معاشی مسائل ,شادی کے مسائل, زوجین کے مسائل
          ,گھریلو/خاندانی مسائل , اولاد کے مسائل, جائیدد، عدالتی مسائل, دشمنی کے
          مسائل ,تعلیمی مسائل ,بیماریوں کا علاج نفسیاتی مسائل ,روحانی مسائل
          ,پریشانیوں سے نجات, حاجات کا پورا ہونا,
        </Text>

        <Text style={styles.heading}> پریشانیوں اور بیماریوں کی وجوہات </Text>
        <Text style={styles.description}>
          {" "}
          مصیبت، مشکل، تکلیف، بیماری، پریشانی… الغرض کچھ بھی ہو، اس کی کوئی وجہ
          ضرورہوتی ہے۔ اصل وجہ تو’’ گناہوں کی شامتِ اعمال‘‘ ہے جس پر بالکل دھیان
          نہیں دیا جاتا۔ دنیا بھر کا علاج کروانے کو ہم تیار ہیں، مگر اللہ کے
          سامنے حقیقی توبہ کرنے اور گناہوں کو چھوڑنے کو تیار نہیں۔ اس لئے ہر
          پریشان اور مصیبت زدہ و بیمار انسان کو چاہیے کہ جتنا ممکن ہو، گناہوں سے
          بچے اور حقیقی توبہ اورکثرت سے استغفار کو اپنا معمول بنائے۔ اللہ کو
          راضی کیے بغیر سلامتی اور عافیت والی زندگی ممکن نہیںہے۔ اہلِ فن فرماتے
          ہیں کہ عمومًاپریشانیوں اور بیماریوں کی وجوہات چار ہوتی ہیں: (۱) نظر بد
          (۲) سحر و جادو (۳)جنات و شیاطین (۴) قدرتی۔ پہلی تین وجوہات کا تعلق
          ’’برے اثرات/بد اثرات‘‘ سے ہے۔ کسی سائل کی پریشانی کی وجہ ایک برا
          اثرہوتا ہے، کسی کی دو اور کسی پر تینوں طرح کے برے اثرات ہوتے ہیں۔
          روحانی تشخیص سے پہلی تین وجوہات کا پتہ لگایا جا سکتاہے۔ سب سے پہلے
          روحانی تشخیص کروائیں تاکہ تسلی ہو جائےکہ پہلی تین وجوہات میں سے کوئی
          موجود تونہیں۔ اگرپہلی تین وجوہات میں سے کوئی بھی ہو تواس کو دور کئے
          بغیر پریشانی سے مکمل نجات نہیں ملتی اور نہ بیماری سے مکمل شفا ملتی ہے۔
          خصوصًا جسمانی بیماریوں کے مریض علاج پر اپنا وقت اور پیسہ برباد کرتے
          ہیں لیکن شفا نہیں ہوتی اور کئی بار صحت مزیدخراب ہو جاتی ہے۔ پھر روحانی
          علاج سے اثراتِ بد کو دور کرنے میںوقت لگتا ہے اور اس کے بعدجسمانی علاج
          پر دوبارہ وقت اور پیسہ خرچ ہوتا ہے۔ اس اصول کا مریضوں اور عاملین کی
          کثیر تعداد کو بہت تجربہ ہے ۔ اگر پہلی تین وجوہات میں سے کوئی وجہ نہ ہو
          تو لازمی چوتھی وجہ ہوتی ہے۔ چوتھی وجہ ہو تو کسی اللہ والے عالم یا بزرگ
          سے رجوع کیا جائے۔ اللہ کو ناراض کرنے والے اعمال چھوڑ کر راضی کرنے کے
          اعمال کیے جائیں۔{" "}
        </Text>

        <Text style={styles.heading}>
          ادارہ روحانیات میں روحانی علاج کرنے کے چار طریقے{" "}
        </Text>
        <Text style={styles.description}>
          ادارہ روحانیات میں چار طریقوں سے روحانی علاج کیا جاتا ہے۔ علاج کا کوئی
          بھی طریقہ ہو، وہ ایک دنیاوی تدبیر سے زیادہ کچھ نہیں ہوتا۔ نتیجہ صرف
          اور صرف اللہ تعالیٰ ہی مرتب فرماتے ہیں۔ یہ عقیدہ رکھنا کہ نتیجہ اللہ
          کے علاوہ کوئی مرتب کر سکتا ہے … یہ ’’شرک‘‘ ہے۔اس عقیدہ کی اصلاح کرنا
          لازم ہے۔ چاروں طریقوں کی تفصیل یہ ہے:۔
        </Text>
        <Text style={styles.heading}>طریقہ اول</Text>
        <Text style={styles.description}>
          اس طریقے میں روحانی معالجین سائل/ مریض کے حالات سننے کے بعد
          وظیفہ/روحانی علاج بتا دیتے ہیں جس پر ساری محنت سائل/ مریض نے خود کرنی
          ہوتی ہے۔ روحانی معالجین پیچھے سے روحانی مدد نہیں کرتےاور نہ ہی کوئی
          عمل کرتے ہیں۔ سائل /مریض سے کوئی ھدیہ طلب نہیں کیا جاتا البتہ وہ اپنی
          مرضی سے جو ھدیہ دینا چاہے، دے سکتا ہے۔
        </Text>
        <Text style={styles.heading}>طریقہ دوم </Text>
        <Text style={styles.description}>
          اس طریقے میں روحانی معالجین سائل/ مریض کے حالات سننے کے بعد روحانی
          علاج دیتے ہیں جو وظائف اور تعویذات پر مشتمل ہو سکتا ہے۔ اس طریقے میں
          بھی محنت سائل/مریض کو ہی کرنی ہوتی ہے البتہ روحانی معالجین کی روحانی
          قوت غائبانہ طور پر سائل /مریض کی معاونت کرتی ہے اور ضرورت ہو تو دورانِ
          علاج مریض/سائل روحانی معالج سے مشاورت بھی کر سکتا ہے۔ اس کی مثال ایسی
          ہے کہ روحانی معالج سائل/مریض کو اپنا ہتھیار دیتا ہے۔ ہتھیار چلانا
          سائل/مریض کا کام ہے۔ جیسے کہا جائے، ویسے سائل/ مریض کو کرنا چاہیے تاکہ
          بھرپور فائدہ ہو۔جو سائل/مریض علاج کیلئے مدرسہ تعلیم القرآن لاہور
          تشریف لاتے ہیں، ان کو ایک سے دو ہفتے کا علاج دیاجاتا ہے۔ سائل/مریض سے
          کوئی ھدیہ طلب نہیں کیا جاتا البتہ وہ اپنی مرضی سے جو ھدیہ دینا چاہے،
          دے سکتا ہے۔ البتہ اگر روحانی دکان کا تیار علاج دیا جائے یا اشیاء دی
          جائیں تو ان کی قیمت وصول کی جاتی ہے۔
        </Text>
        <Text style={styles.heading}> طریقہ سوم </Text>
        <Text style={styles.description}>
          اس طریقے میںسائل؍مریض کو اس کے مسئلے کے مطابق کسی روحانی عمل کی اجازت
          دی جاتی ہے۔ اس عمل کے پیچھے غیبی مخلوق کو تاکید کی جاتی ہے کہ وہ مریض
          کے مسئلے کے حل کے لیے جتنا ممکن ہو، وہ تعاون کرے۔ عمل کو استعمال کرنے
          کے بارے میں سائل کی مکمل رہنمائی کی جاتی ہے۔سائل صرف اپنی ذات اور گھر
          والوں کے لیے اس عمل سے فائدہ اٹھا سکتا ہے۔ عمل کی تجویز روحانی علاج
          گاہ کے روحانی معالجین کرتے ہیں۔ کسی عمل کا ھدیہ لیا جاتا ہے، کسی کا
          نہیں۔
        </Text>
        <Text style={styles.heading}> طریقہ چہارم </Text>
        <Text style={styles.description}>
          {" "}
          اس طریقے میں روحانی معالجین علاج کے ساتھ ساتھ خود بھی سائل/ مریض کے
          لیے عمل کرتے ہیں۔اس کی مثال ایسی ہے کہ روحانی معالج اپنے ہتھیاروں کے
          ساتھ سائل/مریض کے دشمن کا خود سامنا کرتا ہے اور سائل کو اپنےپیچھے کر
          دیتا ہے ۔راتوں کو بیٹھ کر پڑھتابھی ہے اور جیسی روحانی مدد کی ضرورت ہو،
          وہ بھی کرتا ہے۔ سائل/مریض اپنے روحانی معالج سے مکمل رابطے میں رہتا ہے۔
          اور روزمرہ حالات کی اطلاع کرکے مشورہ لے سکتا ہے۔ اس طریقے میں کافی
          محنت کرنی پڑتی ہے، وقت لگتا ہے اور جنات جادو کے علاج میں عامل اور اس
          کے اہل و عیال کو خطرہ بھی ہوتا ہے۔ ادارہ روحانیات کے جس ’’روحانی
          معالج‘‘ سے آپ نے علاج کروانا ہے، معاملات بھی وہی طے کرے گا۔ھدیہ کتنا
          ہوگا؟ کتنی مدت تک ’’روحانی معالج‘‘ مدد کرے گا؟ اور اس طرح کے تمام
          معاملات پہلے طے کریں۔ اس لیے بہتر ہے کہ پہلے استخارہ کرلیا جائے کہ
          روحانی علاج گاہ کےفلاں روحانی معالج سے علاج کراؤں یا نہیں؟ اگر مطمئن
          ہوں تو پھر رابطہ کریں۔یاد رہے کہ تدبیر ہماری ہوگی مگر نتیجہ صرف اللہ
          تعالیٰ ہی مرتب فرماتے ہیں۔رقم محنت کی لی جاتی ہے، نتیجے کی نہیں۔ جو
          بھی خرچہ ہوگا اور رقم وصول کی جائے گی، وہ نا قابلِ واپسی ہوگا۔
        </Text>
      </ScrollView>
    </CustomBackground>
  );
}

const styles = StyleSheet.create({
  heading: {
    fontSize: 22,
    lineHeight: 50,
    fontFamily: "NotoNastaliqUrdu-Regular",
    color: "#6C472D",
    marginTop: 20,
    textAlign: "right",
    writingDirection: "rtl",
  },
  description: {
    marginTop: 10,
    fontSize: 16,
    color: "#6C472D",
    lineHeight: 30,
    fontFamily: "NotoNastaliqUrdu-Regular",
    textAlign: "right",
    writingDirection: "rtl",
  },
});
