import { View, Text, StyleSheet, Image, ScrollView } from "react-native";
import CustomBackground from "../../../../../components/Background/Background";

export default function SirparastScreen() {
  return (
    <CustomBackground>
      <ScrollView>
        <View style={styles.image_section}>
          <Image
            source={require("../../../../../assets/images/sarparast.png")}
            style={styles.image}
          />
        </View>
        <View>
          <Text style={styles.heading}>مختصر تعارف</Text>
          <Text style={styles.description}>
            بانی و سرپرست اعلی ادارہ روحانیات و مدرسہ تعلیم القرآن لاہور ۔پیر
            طریقت حضرت مولاناحافظ و قاری محمد عثمان چشتی ،قادری، نقشبندی
            ،سہروردی، شازلی، رفاعی۔کی پیدائش جولائی 1981 میں لاہور میں ہو ئی اور
            بنیادی تعلیم علاقے کے پرائیویٹ سکول سے حاصل کی 1995میں مین بلیوارڈ
            ڈیفنس لاہور کینٹ کے مدرسہ قرآنک انسٹیٹیوٹ سے قرآن کریم حفظ
            کیا۔1997 میں لاہور کینٹ سے میٹرک اعلی درجے میں کامیابی حاصل کی۔اس کے
            بعد ایک لمبا عرصہ قرآن کریم کی خدمت میں صرف کیا۔بعدازاں ماڈل ٹاؤن
            میں ایک پرائیویٹ ادارے سےدینی علوم یعنی درس نظامی کا کورس کیااپنے
            وقت کے جبال علم کے سامنے زانوئے تلمذ کا شرف حاصل ہوادینی علوم کے
            حصول کے ساتھ ساتھ معاش کیلئے کام کرتا رہا ۔چونکہ فطرت سلیمہ اول دن
            سے ہی مخفی علوم کی طرف راغب تھی۔چنانچہ علوم اسلامیہ کے حصول کے ساتھ
            ساتھ روحانی مخفی علوم حاصل کرنے کیلئے مختلف اساتذہ کرام کی خدمت کی
            اور چھٹی والے دن ان کے آستانے پر جانا اور سارا دن مریضوں کی خدمت
            کرتا تاکہ کچھ مخفی علوم اور طریقے سیکھ لیںمگر جیسا کہ مثل مشہور ہے
            کہ قیمتی گوہر یوں ہی راہ چلتے مل جائیں توگوہر نایاب نہ ہوئے۔لہذاسا
            حلال پیسہ اور قیمتی وقت بہت برباد کیا۔اس دوران بہت سی کتابوں کا
            مطالعہ کیا مگر کوئی بھی ان اعمال کی ریاضاتیں اور چلہ کشی کروانے کو
            کوئی بھی تیار نہیں ہوتا تھا۔جب بندہ کسی بڑے مقصد کے حصول کیلئے کوشش
            کرتاہے تواللہ تعالی کی طرف سے امتحانات بھی آتے ہیںاسی طرح مجھے بھی
            ان امتحانات کی صبر آزما گھاٹی سے گزرنا پڑابندے نے ایک پلاٹ خرید کر
            اپنا گھر بنایا اور بچوں کے ساتھ وہاں شفٹ ہو گئے وہاں جانے کے بعد دن
            بدن حالات خراب ہوتے گئے یہاں تک کہ گھر میں فاقے شروع ہو گئے ۔گھر
            بیچنے پر لگایا وہ بھی نہ بک سکا۔چونکہ ان علوم سے واقفیت اورمناسبت تو
            تھی ہی اور بحمداللہ حافظِ قرآن بھی تھاتو مجھے اندازہ ہو گیا کہ یہاں
            جنات موجود ہیں جن کی میرے ساتھ مطابقت نہیں ہو رہی مگر میں ان کو
            نکالنے میں بڑی دشواری ہورہی تھی ۔اپنے طور پر بہت کوشش بھی کررہا تھا
            روزانہ سورۃ البقرہ کی تلاوت کرنےکے ساتھ ساتھ کئی اور اعمال بھی کئے
            مگر حالات اور خراب سے خراب تر ہوتے گئے بہت سے عاملین کے پاس گیا مگر
            کوئی خاطر خواہ فائدہ نہ ہوا چونکہ اس گھر میں جنات تھے اور جنات سے
            لڑائی کا رسک کسی نے بھی نہیں لیااور کوئی بھی عامل ان کو نکانے
            پرآمادہ نہ ہوا۔ایک رات جب میرا بیٹا روتا ہوا بھوکاہی سو گیا تو یہ
            رات میرے لئے مشکل ترین رات تھی۔ مجھے اس رات بالکل نیند نہ آئی اور
            نہ ہی آنی تھی۔۔ اس رات میں اللہ کریم کے آگے بہت رویا اور اللہ کریم
            سے توبہ کے ساتھ سا تھ مدد مانگتا رہا اگلے دن میں نے سارا معاملہ اپنے
            درس نظامی استاد محترم کےسامنے رکھا انھوں نے میری رہنمائی فرمائی اور
            فرمایاکہ دنیا میں کوئی بھی شخص آپ کی جنگ نہیں لڑے گا اور نہ ہی آپ
            کی جگہ اپنا سر کٹوائے گا ۔آپ خود کو تیار کریں اور اپنے معاملات خود
            حل کریں میں آپ کی رہنمائی کروں گا اپنی زیر نگرانی عمل کرواؤں گا
            ساتھ ساتھآپ کوآپ کے گھر کا علاج کرنے کا طریقہ بھی سیکھاوں گا۔ تو
            مسئلہ جلد حل ہو جائے گا اور آئندہ اس طرح کا مسئلہ نہیں ہو گا ان
            شاءاللہ۔ اس کے بعدجو انھوں نےجتنی رقم کا تقاضا فرمایا وہ بندے نے کسی
            سے قرض لے کر ادا کی تو استاد محترم نے چہل کاف کے عمل کی اجازت دی اور
            عمل کا طریقہ بتا یا پھر میں نے عمل شروع کیا ۔ابھی کچھ ہی دن گزرے تھے
            الحمدللہ تمام معاملات ٹھیک ہو نا شروع ہو گئے۔ اس دوران مجھے محسوس
            ہورہا تھا۔ وہ لوگ جنہوں نے کسی وقت مجھ پر جادو کیا یا کروایا تھا وہ
            سب بھی مجھ پر عیاں ہو نا شروع ہو گئے خواب کی صورت میں۔جنات خواب میں
            بھاگتے نظر آتے یا کبھی لڑائی کر کے ہارتے ہوئے نظر آتے اس کے ساتھ
            ساتھ کاروباری حالات بہتر ہوتے گئے بلکہ پہلے سے بھی بہتر ہو گئے ۔پھر
            اپنے استاد محترم کی زیر نگرانی بہت سے اعمال کئے اورہدیہ ادا کر کے
            اور بہت سے اعمال کی اجازتیں لیں اور چلہ کشی کی اور عرض کیا کہ میں
            عملیات کے شعبےمیں آنا چاہتا ہوں ان کی اجازت کے ساتھ اور ان کے زیر
            سایہ آگے چلتارہااور ان سے طریقہ علاج سیکھتارہا پھر انھوں نے کسی
            شرعی عذر کی وجہ سے دوسرے استادصاحب کی طرف رہنمائی کر دی پھر ان کے
            زیر سایہ بہت سے اعمال کئے اور خوب چلہ کشی کی۔ قبرستان میں، مختلف
            مزاروں پر ، ویرانوں میں اور اپنے گھر میں اور پھراللہ کریم نے مزید
            کرم فرمایا اور دستگیری فرمائی حضرت اقدس امام الاؤلیاء مخدوم
            الاتقیاء شیخ کامل پیر طریقت رہبرشریعت محمد شکیل اختر صاحب دامت
            برکاتہم(پشاور) کی خدمت عالیہ میں بیعت کی عاجزانہ درخواست کی اور حضرت
            والا نےکمال سخاوت اور ایک ذرۂ بےحقیقت کی طرف نسبت منتقل فرمائی اور
            مجازِ خلافت بنایا۔ آج جس مقام پر ہیں یہ سب اساتذہ کرام کی برکات اور
            حضرت اقدس پیر صاحب کی توجہات اور دعاؤں کا اثر ہے جس برکت سے آج
            پاکستان اور بیرون ممالک میں اساتذہ اور الشیخ کا فیض جاری ہے۔آج
            ادارہ روحانیات کے نام سے قابل فخر مخلوق خدا کی خدمت میں مصروف
            ہوں۔اوراپنےمشائخ کرام کے زیر سایہ مزید روحانی علوم میں ریاضات
            ومجاہدات میں مگن ہوں ۔کیونکہ روحانی علوم ایک سمندر ہے۔مخلوق کی خدمت
            کیلئے بہت سی کتب ترتیب دی ہیں۔
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}

const styles = StyleSheet.create({
  heading: {
    fontSize: 25,
    fontWeight: "bold",
    color: "#6C472D",
    textAlign: "right",
    marginTop: 10,
    writingDirection: "rtl",
  },
  description: {
    marginTop: 10,
    fontSize: 16,
    color: "#6C472D",
    lineHeight: 30,
    textAlign: "right",
    writingDirection: "rtl",
  },
  image_section: {
    justifyContent: "center",
    alignItems: "center",
  },
  image: {
    width: 200,
    height: 240,
  },
});
