import { ScrollView, StyleSheet, Text, View } from "react-native";
import CustomBackground from "../../components/Background/Background";
export default function TavezatUsmaniaTaruf() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={styles.heading}>تعویذات عثمانیہ کا مختصر تعارف</Text>
          <Text style={styles.description}>
            یہ تعویذات ہمارے ادارے کے خاص الخاص تعویذات ہیں۔ امت مسلمہ کی خدمت کیلئے حضرت پیر صاحب دامت برکاتہم نے ان تعویذات کی طاقت کو حاصل کرنے کیلئے بہت دن و رات کی اَن تھک محنت کی ہے اور کثیر تعداد میں سرمایہ خرچ کیا ہے۔
            آج کے دور میں ان طاقتوں کو حاصل کرنا ہر عامل کیلئے اہم ضرورت ہے، مگر ان طاقتوں کو حاصل کرنا ہر کسی کے بس کی بات نہیں۔
            آئندہ آنے والے وقت یعنی دجالی فتنے کے دور میں صرف اور صرف یہی طاقتیں کام کریں گی۔ یہ آج ہمیں کھلی آنکھوں سے نظر آ رہا ہے۔ روحانی علاج پہلے کی طرح اثر نہیں کر رہے۔ ہر گھر، ہر جگہ جادو، جنات اور اثرات دندناتے پھر رہے ہیں۔
          </Text>
          <Text style={styles.description}>
            ان تعویذات کے پیچھے جو روحانی طاقتیں کام کرتی ہیں، یہ طاقتیں حاصل کرنا ہر کسی کے بس کی بات نہیں، محض دعوے ہر کوئی کر سکتا ہے۔ اصل تو آپ کا کام بولتا ہے۔
            ہمارے تعویذات جنہوں نے استعمال کیے ہیں، ان کو اللہ کے حکم سے 3 سے 7 دن میں بہترین رزلٹ ملے ہیں۔
          </Text>
          <Text style={styles.description}>
            ہمارے تعویذات کے پیچھے کام کرنے والی طاقتیں دنیا کے ہر کونے میں تیز ترین کام کرتی ہیں۔ یہ طاقتیں تمام مہینوں اور تمام دنوں میں تیز ترین کام کرتی ہیں۔
            اس لیے تعویذات عثمانیہ کا دنیا میں کوئی ثانی نہیں۔ ان تعویذات کے رزلٹ کھلی آنکھوں سے نظر آتے ہیں۔
            ان تعویذات میں سب سے بڑی آسانی یہ ہے کہ سائل/مریض کو زیادہ محنت نہیں کرنا پڑتی اور نہ ہی کوئی پڑھائی کرنا پڑتی ہے۔
            ان تعویذات کو 24 گھنٹوں میں صرف 3 سے 5 منٹ استعمال کرنا ہوتا ہے، وہ بھی اپنے گھر یا اپنے کمرے میں رہتے ہوئے۔
            ان تعویذات کو استعمال کرنے سے گھر میں کسی کو معلوم بھی نہیں ہوتا۔ بہت رازداری سے تعویذات استعمال کیے جا سکتے ہیں۔
          </Text>
          <Text style={styles.description}>
            ہمارے تعویذات کو پوری دنیا میں گھر بیٹھے بذریعہ واٹس ایپ آسانی سے حاصل کر سکتے ہیں۔
            ان تعویذات کو پوری دنیا میں ہر طرح کے کاموں کیلئے استعمال کیا جا سکتا ہے جس کے تیز ترین رزلٹ ملتے ہیں اللہ کے حکم سے۔
            تدبیر یا اسباب کے درجے میں کوئی بھی تعویذات کا استعمال کریں تو بہرحال رزلٹ اللہ ہی مرتب فرماتے ہیں۔
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}
const styles = StyleSheet.create({
  heading: {
    fontSize: 28,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
  subheading: {
    fontSize: 24,
    fontFamily: "Jameel-Noori-Regular",
    color: "#6C472D",
    textAlign: "right",
    writingDirection: "rtl",
  },
  description: {
    fontSize: 20,
    color: "#6C472D",
    fontFamily: "Jameel-Noori-Regular",
    textAlign: "right",
    writingDirection: "rtl",
  },
});

