import { Image, ScrollView, Text, View } from "react-native";
import CustomBackground from "../../components/Background/Background";
import { sarparastStyles } from "../../style/styleDetails";
export default function SirparastScreen() {
  return (
    <CustomBackground>
      <ScrollView>
        <View style={sarparastStyles.image_section}>
          <Image
            source={require("../../assets/images/sarparast.png")}
            style={sarparastStyles.image}
          />
        </View>
        <View>
          <Text style={sarparastStyles.heading}>مختصر تعارف</Text>
          <Text style={sarparastStyles.description}>
            بانی و سرپرست اعلیٰ ادارہ روحانیات و مدرسہ تعلیم القرآن لاہور، پیر
            طریقت حضرت مولانا حافظ و قاری محمد عثمان چشتی، قادری، نقشبندی،
            سہروردی، شاذلی، رفاعی کی پیدائش جولائی 1981 میں لاہور میں ہوئی اور
            بنیادی تعلیم علاقے کے پرائیویٹ سکول سے حاصل کی۔ 1995 میں مین بلیوارڈ
            ڈیفنس لاہور کینٹ کے مدرسہ قرآن انسٹیٹیوٹ سے قرآن کریم حفظ کیا۔ 1997
            میں لاہور کینٹ سے میٹرک اعلیٰ درجے میں کامیابی سے مکمل کیا۔ اس کے
            بعد ایک لمبا عرصہ قرآن کریم کی خدمت میں صرف کیا۔ بعد ازاں ماڈل ٹاؤن
            میں ایک پرائیویٹ ادارے سے دینی علوم یعنی درس نظامی کا کورس کیا۔ اپنے
            وقت کے جبالِ علم کے سامنے زانوئے تلمذ کا شرف حاصل ہوا۔ دینی علوم کے
            حصول کے ساتھ ساتھ معاش کے لیے کام بھی کرتا رہا۔ چونکہ فطرت سلیمہ
            شروع سے ہی مخفی علوم کی طرف راغب تھی، لہٰذا علومِ اسلامیہ کے ساتھ
            ساتھ روحانی مخفی علوم کے حصول کے لیے مختلف اساتذہ کرام کی خدمت کی۔
            چھٹی والے دن ان کے آستانے پر جانا اور مریضوں کی خدمت کرنا معمول بن
            گیا تاکہ کچھ مخفی علوم اور طریقے سیکھے جا سکیں۔ مگر جیسا کہ کہا جاتا
            ہے کہ قیمتی گوہر راہ چلتے نہیں ملتے، اسی لیے بہت سا وقت اور حلال
            پیسہ برباد کیا۔ اس دوران بہت سی کتابوں کا مطالعہ کیا مگر کوئی بھی ان
            اعمال کی ریاضتیں یا چلہ کشی کروانے کو تیار نہ تھا۔ جب بندہ کسی بڑے
            مقصد کے حصول کی کوشش کرتا ہے تو اللہ تعالیٰ کی طرف سے امتحانات بھی
            آتے ہیں۔ ایک پلاٹ خریدا، گھر بنایا اور بچوں کے ساتھ شفٹ ہو گئے، مگر
            حالات دن بدن خراب ہوتے گئے۔ یہاں تک کہ فاقوں کی نوبت آ گئی۔ گھر
            بیچنے کی کوشش کی مگر وہ بھی نہ بکا۔ چونکہ ان علوم سے واقفیت تھی اور
            بحمدللہ حافظِ قرآن بھی تھا، اندازہ ہو گیا کہ گھر میں جنات کی موجودگی
            ہے۔ سورۃ البقرہ کی تلاوت اور دیگر اعمال کیے مگر کوئی خاطر خواہ فائدہ
            نہ ہوا۔ عاملین کے پاس گیا مگر کسی نے بھی لڑائی کا رسک نہیں لیا۔ ایک
            رات بیٹا بھوکا روتے سوتا رہا تو وہ میرے لیے سخت ترین رات تھی۔ اللہ
            کریم سے بہت گریہ و زاری کی اور مدد طلب کی۔ اگلے دن اپنے استاد محترم
            کو تمام حالات بتائے۔ انھوں نے رہنمائی فرمائی کہ آپ خود اپنے مسائل حل
            کریں، میں صرف راہنمائی کروں گا۔ قرض لے کر چہل کاف کے عمل کی اجازت لی
            اور چند ہی دنوں میں الحمدللہ بہتری آنا شروع ہو گئی۔ جن لوگوں نے جادو
            کیا تھا، وہ خواب میں ظاہر ہونا شروع ہو گئے۔ کاروبار بھی بہتر ہونے
            لگا۔ پھر مزید اعمال کی اجازت لی، چلہ کشی کی، اور عملیات کے شعبے میں
            باقاعدہ قدم رکھا۔ استاد محترم کی رہنمائی میں سیکھتا رہا۔ پھر کسی
            شرعی مجبوری کے تحت دوسرے استاد کی طرف رہنمائی ہوئی، ان سے مزید چلہ
            کشی و عملیات سیکھے۔ ویرانوں، مزاروں، قبرستانوں اور اپنے گھر میں
            ریاضات کیں۔ اللہ تعالیٰ کے فضل و کرم سے حضرت اقدس امام الاولیاء
            مخدوم الاتقیاء شیخ کامل پیر طریقت محمد شکیل اختر صاحب دامت برکاتهم
            (پشاور) کی خدمت میں بیعت کی درخواست کی، اور حضرت والا نے نسبت عطا
            فرمائی اور مجازِ خلافت بنایا۔ آج جو مقام حاصل ہے، وہ میرے اساتذہ
            کرام کی برکات اور حضرت اقدس کی دعاؤں کا نتیجہ ہے۔ آج پاکستان اور
            بیرونِ ملک اساتذہ و الشیخ کا فیض جاری ہے۔ ادارہ روحانیات کے نام سے
            خدا کی مخلوق کی خدمت میں مصروف ہوں اور مشائخ کرام کے زیر سایہ مزید
            روحانی ریاضات و مجاہدات میں مصروف عمل ہوں۔ کیونکہ روحانی علوم ایک
            سمندر ہیں۔ مخلوق کی خدمت کے لیے کئی کتب بھی ترتیب دی گئی ہیں۔
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}