import { ScrollView, Text, View } from "react-native";
import CustomBackground from "../../components/Background/Background";
import { mainStyles } from "../../style/globalcss";
export default function AmliyatCourseScreen() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={mainStyles.heading}> روحانی عملیات کورسز</Text>
          <Text style={mainStyles.description}>
            ادارہ روحانیات کے زیر تحت یہ شعبہ روحانی عملیات کورسز 2001 میں قائم
            کیا گیا۔ یہ شعبہ روحانی و مخفی علوم سکھانے کا شعبہ ہے۔ الحمدللہ کثیر
            تعداد میں طالبین علومِ روحانیات ، روحانی علوم سیکھ چکے ہیں اور سیکھ
            رہے ہیں۔ ابتدا سے انتہا تک تمام منازل روحانی نگرانی میں طے کروائی
            جاتی ہیں۔ روحانی تشخیص کرنا، جادو اور جنات کا علاج کرنا، حب و بغض کے
            عملیات، جسمانی بیماریوں کا روحانی علاج، حصارات اور دفاع کے کثیر
            اعمال، دشمن سے نمٹنے اور نجات کے اعمال، انسانی اور جناتی جادوگروں سے
            مقابلہ کرنا، واپسی سحر کے اعمال، حاجت روائی کے اعمال، علم الاعداد،
            علم النقوش، علم الساعات اور بہت کچھ سکھایا جاتا ہے۔ جو لوگ چلہ کشی
            نہیں کر سکتے، ان کے لئے نقد صدقہ ادا کرکے سیکھنے کا بھی انتظام ہے۔
            کئی اعمال ہیں جو نقد صدقہ ادا کرکے لئے جا سکتے ہیں۔ نیز روحانی
            عاملین جو بنیادی درجہ حاصل کر چکے ہوں، ان کو بڑے بامؤکل اعمال بھی
            کروائے جاتے ہیں۔ اور کئی دوسرے اعمال، جو شرعاً جائز ہیں، بھی سکھائے
            جاتے ہیں جو تجربے میں بہت مفید ثابت ہوئے ہیں۔ ہمارے اعمال کے پیچھے
            باقاعدہ روحانی مخلوق غائبانہ کام کرتی ہے۔ جس کسی وجہ ہمارے اعمال کی
            تاثیر بہت زیادہ ہوتی ہے اور کھلی آنکھوں سے رزلٹ نظر آتے ہیں ،ہمارے
            اعمال کی چلہ کشی کے دوران کسی قسم کا کوئی خوف و ضطرہ نہیں ہوتا اور
            نہ کوئی مخلوق سامنے آتی اور کسی قسم کی رجعت کا خطرہ بھی نہیں ہوتا
            الحمدللہ ہماری درسگاہ میں مسلکی اختلافات سے بالاتر ہو کر روحانی علوم
            کی تعلیم دی جاتی ہے۔ آئیے، روحانی علوم کی سیکھ کر بلا تفریق مسلک،
            انسانیت کی خدمت کیجئے۔ ادارہ روحانیات کے شعبہ روحانی عملیات کورسز
            میں پوری دنیا میں آن لائن مرد و خواتین داخلہ لے سکتے ہیں۔
          </Text>
          <Text style={mainStyles.heading}> کورسز کی تفصیل</Text>
          <Text style={mainStyles.description}>
            روحانی عملیات کورس کرنے والے خواتین و حضرات کیلئے اعمال کی اجازت لے
            کر روحانی مخلوق کے ہاں نام درج کروانا شرط ہے تاکہ آپ کی دوران چلہ
            روحانی نگرانی ہو سکے اور دوران علاج مخلوق کی غائبانہ روحانی مدد حاصل
            ہو سکے۔ ادارے میں کئی علوم پر مشتمل کورسز کروائے جاتے ہیں۔ ہر کورس
            کی فیس مقرر ہے اور الگ الگ دورانیہ ہے۔ چند کورسز میں طالب علم کی
            روحانی حیثیت کو دیکھتے ہوئے اعمال اور دورانیہ میں کمی بیشی بھی کی
            جاتی ہے۔
          </Text>
          <Text style={mainStyles.heading}> ظاہری سماعت یا نظر کھولنا </Text>
          <Text style={mainStyles.description}>
            بہت سے احباب مسلسل رابطہ کرتے رہتے ہیں اور غیبی مخلوق کو دیکھنے اور
            بات چیت کرنے کی خواہش کا اظہار کرتے رہتے ہیں۔کچھ خواتین و حضرات
            نےہمارے ادارے سے عمل کیے ہوئے ہوتے ہیں تو کچھ نے کہیں اور سے۔ کچھ یہ
            سمجھ کر عمل کر رہے ہوتے ہیں کہ ’’عمل کروں گا تو جن سامنے حاضر ہو
            جائے گا اور میں جو کام اس کو کہوں گا، وہ کرے گا۔اس کیلئے پیشگی
            معذرت۔
          </Text>
          <Text style={mainStyles.heading}> خاص اوقات کے اعمال </Text>
          <Text style={mainStyles.description}>
            سال میں کئی خاص اوقات آتے ہیں جن میں اسی وقت میں عملیات کی زکوٰۃ کے
            لئے بہت مفید ہوتے ہیں۔ الحمدللہ کافی عرصہ سے ان خاص اوقات میں عملیات
            کروانے کا سلسلہ چل رہا ہے۔ چند اہم اور خاص اوقات یہ ہیں:۔
          </Text>
          <View >
            <Text style={mainStyles.item}>• چاند گرہن</Text>
            <Text style={mainStyles.item}>• سورج گرہن</Text>
            <Text style={mainStyles.item}>• نوروز</Text>
          </View>
          <Text style={mainStyles.description}>
            سال میں کئی خاص مہینے آتے ہیں جو عملیات کی زکوٰۃ کے لئے بہت مفید
            ہوتے ہیں۔ان خاص مہینوں میں چند دن اعمال کی ریاضت کروانے بہت زیادہ
            طاقت حاص ہو جاتی ہے۔الحمدللہ کافی عرصہ سے ان خاص مہینوں میں عملیات
            کروانے کا سلسلہ چل رہا ہے۔ چند اہم اور خاص مہینے یہ ہیں:۔
          </Text>
          <View >
            <Text style={mainStyles.item}>• محرم الحرام</Text>
            <Text style={mainStyles.item}>• صفر المظفر</Text>
            <Text style={mainStyles.item}>• ربیع الاول</Text>
            <Text style={mainStyles.item}>• رمضان المبارک</Text>
          </View>
          <Text style={mainStyles.description}>
            پورا سال کروائے جانے والے اعمال جن کے پیچھے باقاعدہ غائبانہ روحانی
            مخلوق کام کرتی ہے اور عامل طاقت میں اضافہ ہوتا رہتا ہے ۔ان اعمال کی
            مدد سے عامل صحیح معنوں میں امت مسلمہ کی خدمت کر سکتے ہیں اور اپنا
            نام روشن کر سکتے ہیں ۔
          </Text>
          <View >
            <Text style={mainStyles.item}>• نورانی اعمال</Text>
            <Text style={mainStyles.item}>• نورانی علوی اعمال</Text>
            <Text style={mainStyles.item}>• علوی اعمال </Text>
            <Text style={mainStyles.item}>• باموکل اعمال </Text>
            <Text style={mainStyles.item}>• اولیاءاللہ کے اعمال </Text>
            <Text style={mainStyles.item}>• خاص الخاص اعمال </Text>
          </View>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}
