import { ScrollView, Text, View } from "react-native";
import CustomBackground from "../../../components/Background/Background";
import { mainStyles } from "../../../style/globalcss";

export default function JaduJinnatKiAlamat() {
  return (
    <CustomBackground>
      <ScrollView>
        <View>
          <Text style={mainStyles.heading}>
            جادو، جنات اور نظر بد کی علامات
          </Text>

          <Text style={mainStyles.description}>
            عملیات کورس میں روحانی علوم اور عملیات کے اصول سکھائے جاتے ہیں تاکہ
            لوگ قرآنی اور اسلامی طریقے سے اپنی زندگی بہتر بنا سکیں۔
          </Text>

          <Text style={mainStyles.description}>
            جنات کا اثر (جسے "جن" یا "جنات کا سایہ" بھی کہا جاتا ہے) انسان کے
            جسم، دماغ، یا زندگی پر ظاہر ہو سکتا ہے۔ درج ذیل میں تفصیل سے علامات
            بیان کی جا رہی ہیں جو جسمانی، ذہنی، روحانی اور رویّے سے متعلق ہوتی
            ہیں۔
          </Text>

          <Text style={mainStyles.heading}>جنات کے اثر کی تفصیلی علامات</Text>
          <Text style={mainStyles.subheading}>
            1. نیند اور خوابوں میں علامات:
          </Text>
          <Text style={mainStyles.description}>
            عجیب و خوفناک خواب آنا، جیسے سانپ، کتے، بلیاں، چھپکلی، شیر، درندے
            وغیرہ دیکھنا۔ اندھیرے میں بھاگنا، انچائی سے گرنا، بار بار قبرستان
            دیکھنا، خون دیکھنا، یا جلے ہوئے مقامات دیکھنا، نیند میں چیخنا یا
            رونا، نیند میں گھٹن محسوس ہونا یا سانس رکنا، سوتے میں کسی کا جسم پر
            بیٹھ جانا، اچانک ڈر کر جاگنا یا نیند کا اڑ جانا، گندے خوابوں کی وجہ
            سے احتلام ہونا، غلیظ خوابوں میں زنا ہونا یا زنا کرنا، اکثر بستر گیلا
            کرنا (بچوں میں خاص طور پر)۔
          </Text>

          <Text style={mainStyles.subheading}>2. ذہنی و نفسیاتی علامات:</Text>
          <Text style={mainStyles.description}>
            بار بار ذہنی الجھن یا عجیب خیالات آنا، اچانک مزاج کا بگڑ جانا، بغیر
            وجہ کے غصہ، تنہائی پسند ہو جانا، ہر وقت اداسی یا ڈپریشن میں رہنا،
            لوگوں سے گھبراہٹ ہونا، بلا وجہ شدید خوف آنا، بار بار خودکشی کے
            خیالات آنا، کچھ بھی نہ ہونے پر بےچینی اور دل کا گھبرانا، ذہن پر قابو
            نہ رہنا، خیالات بھٹکنا، نہ چاہتے ہوئے بھی وسوسے آنا، اپنی فیملی کے
            بارے میں غلط خیالات کا مسلط ہونا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>3. جسمانی علامات:</Text>
          <Text style={mainStyles.description}>
            جسم کے مختلف حصوں میں حرکت محسوس ہونا، کندھوں، کمر یا گردن میں بوجھ
            محسوس ہونا، جسم پر نیل کے نشان پڑنا، پورے جسم پر یا کسی خاص حصے پر
            کٹ، خراش یا زخم کے نشانات آ جانا، بغیر کسی چوٹ یا بیماری کے سانس
            لینے میں دشواری (خاص طور پر اذان یا قرآن کے وقت)، پیٹ میں پھڑپھڑاہٹ
            یا درد جو دوا سے نہ جائے، بلا وجہ شدید چکر آنا، آنکھوں کے سامنے
            اندھیرا چھا جانا، اچانک کانوں کا بجنا، یا سیٹی جیسی آوازیں آنا، بار
            بار بیمار ہو جانا مگر ڈاکٹری رپورٹس نارمل آنا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>4. روحانی و دینی علامات:</Text>
          <Text style={mainStyles.description}>
            قرآن یا اذان سن کر بےچینی ہونا، اذان کے وقت غصہ یا بھاگنے کو دل
            کرنا، دل نماز، تلاوت یا ذکر سے بیزار ہو جانا، وضو یا نماز میں
            رکاوٹیں آنا، نیکی کی طرف آنے میں شدید مزاحمت محسوس کرنا، قرآن سنتے
            ہوئے جسم کانپنا، رونا یا چیخ نکلنا، دین کے بارے میں گندے اور غلیظ
            خیالات کا آنا، روحانی علاج نہ کرنا اور علاج کرنے والوں کے خلاف غلیظ
            زبان کا استعمال کرنا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>
            5. لب و لہجہ اور زبان پر اثر:
          </Text>
          <Text style={mainStyles.description}>
            بولتے وقت زبان لڑکھڑانا، اچانک مختلف لہجے میں بات کرنا، کسی وقت
            دوسرا انداز یا غیر معمولی آواز نکالنا، دم کرواتے وقت، قرآن کی تلاوت
            سنتے وقت یا اذان کے وقت آواز میں تبدیلی آ جانا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>
            6. گھر میں علامات (اگر جنات کا سایہ ہو):
          </Text>
          <Text style={mainStyles.description}>
            گھر میں ہر وقت بےچینی اور بے سکونی کا ماحول رہنا، بلا وجہ گھر میں
            لڑائی جھگڑا رہنا، گھر میں آتے ہی شدید غصہ آنا، چیزوں کا خود بخود
            گرنا یا ہلنا، پورے گھر یا کسی خاص جگہ سایہ محسوس ہونا، پورے گھر یا
            کسی خاص کمرے سے خوشبو یا بدبو کا آنا، دروازے، الماری یا کھڑکی کا خود
            بخود کھلنا/بند ہونا، گھر میں الیکٹرک اشیاء کا بلا وجہ خراب ہونا،
            برتن ٹوٹنا، پورے گھر یا کسی خاص کمرے کی لائٹ، بلب، پنکھا وغیرہ خود
            بخود چلنا اور بند ہو جانا، گھر میں پکا ہوا کھانا خراب ہو جانا، کیڑے
            پڑ جانا، یا جلدی جلدی ختم ہو جانا، بار بار بچوں کا رونا یا بیمار
            رہنا، رات کو ڈر کر اٹھنا وغیرہ۔
          </Text>
          <Text style={mainStyles.description}>
            نوٹ: یہ تمام علامات ہر فرد میں نہیں ہوتیں۔ اگر کئی علامات مسلسل ظاہر
            ہوں اور طبی علاج بے اثر ہو، تو یہ جنات کے اثر کی نشانی ہو سکتی ہے۔
          </Text>

          <Text style={mainStyles.heading}>
            کاروباری مراکز یا دکان پر جادو و جنات کی علامات
          </Text>

          <Text style={mainStyles.description}>
            اگر کسی دکان، دفتر، یا کاروباری جگہ پر کالا جادو یا جنات کا اثر ہو
            تو وہ جگہ اپنی اصل برکت، کشش اور کامیابی کھو دیتی ہے۔ بظاہر سب کچھ
            درست نظر آتا ہے، لیکن نتائج ہمیشہ الٹ اور منفی ہوتے ہیں۔ عمومی
            علامات: (اگر 3 یا زیادہ علامات مسلسل ظاہر ہوں، تو جادو یا جنات کا
            قوی امکان ہوتا ہے)
          </Text>
          <Text style={mainStyles.subheading}>
            1. کاروباری بندش یا نقصان کی علامات:
          </Text>
          <Text style={mainStyles.description}>
            گاہک آ کر بغیر خریداری کیے واپس چلے جانا، کاروباری جگہ پر گاہکوں کا
            نہ آنا، بے رونقی رہنا، آہستہ آہستہ کام ختم ہوتا ہوا محسوس ہونا یا بے
            برکتی لگنا، اچانک نقصان ہونا، کرایہ یا بلز کا دباؤ بڑھ جانا، بلا وجہ
            ہمیشہ آنے والے پیسوں کا بند ہو جانا، پیسہ آتے ہی ختم ہو جانا، جو چیز
            زیادہ بکتی تھی اب اس کو کوئی پسند نہیں کرتا، آس پاس کی دکانیں خوب
            چلتی ہیں اور ہمیشہ رش لگا رہتا ہے۔
          </Text>

          <Text style={mainStyles.subheading}>
            2. دکان یا جگہ پر غیر معمولی کیفیت:
          </Text>
          <Text style={mainStyles.description}>
            کاروباری جگہ میں سناٹا اور نحوست کا محسوس ہونا، کاروباری جگہ پر بیٹھ
            کے بوجھل پن، گھبراہٹ، دل کا بیٹھنا، نیند آنا، یا سستی، کاہلی، یا جگہ
            سے بھاگنے کو دل کرنا، اچھی لائٹیں جلنے کے باوجود روشنی کا کم لگنا،
            الیکٹرک چیزوں، لائٹ، پنکھا وغیرہ کا بار بار خراب یا جل جانا، سامان
            کی ہلنے یا گرنے کی آواز محسوس ہونا، کاروباری جگہ پر آتے ہی طبیعت
            خراب یا بیزار ہونا، جگہ یا دیواروں سے بدبو آنا، یا عجیب عجیب نشانات
            کا نظر آنا۔
          </Text>

          <Text style={mainStyles.subheading}>
            3. جنات کی موجودگی کی نشانیاں:
          </Text>
          <Text style={mainStyles.description}>
            کاروباری جگہ سے آوازیں آنا، رات یا فجر کے وقت سائے نظر آنا، شیشہ
            ٹوٹنا، الیکٹرانکس کا بار بار خراب ہونا، جانور (بلی، چمگادڑ، کوا) کا
            بار بار آنا، کاروباری جگہ پر پھونکنے، قدموں، یا سانسوں کی آوازیں
            آنا، کسی خاص جگہ یا کونوں سے بدبو یا خوشبو آنا، ٹھنڈک یا گرمی محسوس
            ہونا۔
          </Text>

          <Text style={mainStyles.subheading}>4. بندش اور حسد کی علامات:</Text>
          <Text style={mainStyles.description}>
            کاروبار کی کامیابی کے بعد اچانک تنزلی آنا، نئی دکان کھولتے ہی نقصان
            یا رکاوٹوں کا شکار ہو جانا، علاقے، محلے، معاشرے کے مطابق سارا سامان
            ہونے کے باوجود کام نہ چلنا، کام پر دل نہ لگنا، ملازمین کا بار بار
            کام چھوڑ دینا، بیمار ہونا یا بلاوجہ چھٹیاں کرنا، گاہکوں کا آپ کے پاس
            آ کر بےچینی محسوس کرنا یا جلدی آپ سے بھاگ جانا، گاہکوں کے آنے سے
            طبیعت پر بوجھ آنا یا غصہ آنا۔
          </Text>
          <Text style={mainStyles.heading}>
            کالے جادو (سحرِ اسود) کی علامات کی مکمل تفصیل
          </Text>
          <Text style={mainStyles.description}>
            کالا جادو (Black Magic / سحر اسود / جادُو) شیطانی عمل ہے جس میں جنات
            اور شیاطین کی مدد سے انسان کو جسمانی، ذہنی، روحانی، معاشی یا ازدواجی
            نقصان پہنچایا جاتا ہے۔ یہ عمل حرام، کفریہ اور انسانیت دشمنی پر مبنی
            ہوتا ہے، اور اس کے اثرات واضح اور شدید ہو سکتے ہیں۔
          </Text>

          <Text style={mainStyles.subheading}>کالاجادو کی اقسام:</Text>
          <Text style={mainStyles.description}>
            جدائی کا جادو (سحر التفریق)، محبت کا جادو (تسخیر خاص)، کاروبار یا
            روزگار کی تباہی کے لیے کالا جادو، ہر طرح کی بندش لگانے کا جادو، نیند
            و سکون کا جادو، موت، بیماری یا زوال مسلط کرنے کے لیے جادو، گھر یا
            فیملی کی تباہی و بربادی کا جادو وغیرہ۔
          </Text>

          <Text style={mainStyles.heading}>کالے جادو کی اہم علامات</Text>
          <Text style={mainStyles.subheading}>
            1. نیند اور خواب میں علامات:
          </Text>
          <Text style={mainStyles.description}>
            نیند میں خوفناک خواب، سانپ، بلی، سائے، قبریں دیکھنا، نیند سے گھبرا
            کر جاگنا، سوتے وقت دم گھٹنا، سوتے وقت کسی کا جسم پر بیٹھنے کا احساس
            ہونا، نیند کا نہ آنا، بظاہر سونا لیکن سکون نہ ملنا، سوتے میں اکثر
            احتلام ہونا، خود سو جانا مگر دماغ کا نہ سونا، بچوں کابستر گندا ہونا
            ، گندے اور غلیظ خواب آنا، نیند میں بڑ بڑانا اور باتیں کرنا، نیند
            میں ڈرنا اور گھبراہٹ ہونا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>2. ذہنی و نفسیاتی اثرات:</Text>
          <Text style={mainStyles.description}>
            بار بار پریشانیوں کا احساس ہونا، ذہنی الجھنوں کا شکار رہنا، ، الجھے
            ہوئے خیالات کا آنا، بلاوجہ کا غصہ آنا، فیملی یا لوگوں سے بلا وجہ
            نفرت ہونا، ڈپریشن کی بیماری لاحق ہونام ، بےبسی کا احساس ہونا، اپنی
            بات پر قائم نہ رہنا، فیصلوں میں کمزوروئیے کی وجہ دوسروں سے بدگمانی،
            دوسروں کیلئے بلاوجہ بدگمانی کرنا وغیرہ،
          </Text>

          <Text style={mainStyles.subheading}>3. جسمانی اثرات:</Text>
          <Text style={mainStyles.description}>
            دوا لینے کے باوجود بیماری کا نہ جانا، جسم میں کپکپی ہونا یا اس کا
            احساس ہونا، کمزوری ہونا یا اس کا احساس ہونا، پیٹ میں درد رہنا یا پیٹ
            کا ہر وقت پھولارہنا، جسم میں حرکت یا درد (خاص طور پر ناف کے نیچے)،
            چہرے پر پیلاہٹ یا سیاہی ، اکثر بخار یا تھکن، حالانکہ ٹیسٹ نارمل
            ہوںہاتھ پاؤں میں جھٹکے، رگوں میں کھچاؤ
          </Text>

          <Text style={mainStyles.subheading}>
            4. ازدواجی و رشتہ دارانہ اثرات:
          </Text>
          <Text style={mainStyles.description}>
            میاں بیوی میں جھگڑے، سرد مہریشادی کے لیے رکاوٹیں یا بات بن کر ٹوٹ
            جاناسسرال یا گھر والوں سے بےوجہ ناراضگیبچے پیدا نہ ہونا، یا بار بار
            اسقاط حملشوہر یا بیوی کا بلاوجہ بدگمانی کرنا
          </Text>

          <Text style={mainStyles.subheading}>5. رزق و کاروبار میں بندش:</Text>
          <Text style={mainStyles.description}>
            اچھی کوششوں کے باوجود ناکامیروزگار میں بار بار پریشانیکلائنٹ یا گاہک
            آ کر واپس چلے جانادکان یا کاروبار کی جگہ پر عجیب کیفیت یا سستینفع
            ہونے کے بجائے مسلسل نقصان
          </Text>

          <Text style={mainStyles.subheading}>6. روحانی اثرات:</Text>
          <Text style={mainStyles.description}>
            قرآن سننے یا پڑھنے میں بیزارینماز میں سستی، دل کا نہ لگناقرآن سنتے
            ہوئے چکر آنا، سینے کا دباؤاذکار، اذان یا دم پر چڑچڑاپن یا رونادم
            کے وقت چیخیں نکلنا یا غصہ آنا
          </Text>

          <Text style={mainStyles.subheading}>
            7. گھر میں کالے جادو کے اثرات:
          </Text>
          <Text style={mainStyles.description}>
            ہر وقت لڑائی، چیخ پکار، غصہبرتن، بلب، سامان کا ٹوٹناعجیب آوازیں یا
            سائے محسوس ہوناگھر میں پرندوں یا جانوروں کی عجیب حرکاتمہمانوں کا آ
            کر بےچین ہونا۔ خاص نشانیاں (جب شک پختہ ہو جائے):ایک جیسے خواب بار
            باردم یا قرآن کے دوران جسم پر اثراتعلاج سے وقتی افاقہ مگر پھر
            دوبارہ بگڑ جاناپیٹ میں سختی یا ناف کا ہلناغیر محسوس بندش، جیسے خوشی
            بھی بوجھ لگے
          </Text>

          <Text style={mainStyles.heading}>نظر بد کی علامات کی مکمل تفصیل</Text>
          <Text style={mainStyles.description}>
            بچوں، بڑوں، خواتین، اور گھر/کاروبار سب پر نظرِ بد کا اثر ممکن ہے۔
            نظرِ بد (Evil Eye / Nazar) ایک حقیقی چیز ہے جسے نبی کریم ﷺ نے اس کی
            حقیت کے بارے میں کئی مرتبہ ارشاد فرمایا ہے۔ نظر بد حسد بھری نظروں سے
            لگ جاتی ہے، نظر بد رشک بھری نظروں سے لگ جاتی ہے، نظر بد تعجب میں
            ڈوبی نظروں سے لگ جاتی ہے، سخت کالی نظر کسی نھی دوسرے شخص کو جسمانی،
            ذہنی ، مالی، کاروباری یا روحانی نقصان پہنچا سکتی ہے۔ یہ نظر جان بوجھ
            کر لگائی جا سکتی ہے اور انجانے میں بھی لگ جاتی ہے۔
          </Text>

          <Text style={mainStyles.subheading}>
            1. بچوں میں نظر بد کی علامات:
          </Text>
          <Text style={mainStyles.description}>
            بچوں کا اچانک بلاوجہ رونا یا چیخنا، دودھ پینے یا کھانے سے انکارکرنا،
            بلا وجہ ماں سے لپٹے رہنا، سوتے یا جاگتے میںڈرنا، بار بار بیمار ہونا
            ،بخار، پیٹ کی خرابی ہونا، آنکھوں کا ایک طرف گھمانا، نظریں نہ
            ملاناسوتے ہوئے جھٹکے لگنا، بستر گندا کرنا یا نیند نہ آنا، کسی خاص
            طرف تکتے رہنا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>
            2. بڑوں میں نظر بد کی علامات:
          </Text>
          <Text style={mainStyles.description}>
            اچانک کمزوری یا بیماری کا ہونا (بغیر طبی وجہ کے)، جسم میں بلا وجہ
            شدید درد شروع ہو جانا، ہر وقت سُست ہو جانا، ہر وقت نیند یا تھکن
            محسوس ہونا، دل گھبرانا، طبیعت بوجھل رہنا، نیند کی زیادتی ہونا، چہرے
            پر پیلاہٹ یا بےرنگی کا ہونا، دل کی دھڑکن تیزہونا، سانس گھٹنا یا سانس
            لینے میں دشواری ہونا، سر درد رہنا، سر یا کندھوں پر وزن محسوس ہونا،
            کوئی کام کرنےمیں دل نہ لگنا۔
          </Text>

          <Text style={mainStyles.subheading}>
            3.رشتوں یا ازدواجی زندگی میں نظر بد:
          </Text>
          <Text style={mainStyles.description}>
            میاں بیوی میں محبت میں کمی ہونا، لڑائی جھگڑوں میں شدت آ جانا، شادی
            کے بعد تعلقات میں خرابی آنا، دونوں کو ایک دوسرے سے نفرت ہونا، اولاد
            سے دوری یا نفرت کا اظہار کرنا، بلاجہ فیملی سے ناراضگی اور نفرت کا
            اظہار کرنا، رشتوں کا نہ آنا یا نہ ہونا، شادیوں میں بلا وجہ تاخیر
            ہونا، لڑکا یا لڑکی کا شادی کیلئے راضہ نہ ہونا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>
            4.کاروبار یا مالی معاملات پرنظر بدکے اثرات:
          </Text>
          <Text style={mainStyles.description}>
            کاروبار میں اچانک نقصانات کا ہونا، کاربار پر بند ش کا احساس ہونا،
            گاہکوں کا نہ آنا یا آ کرخالی چلے جانا، کاروباری جگہ میں بیزاری یا
            سوگواری کا احساس ہونا، رزق، روزگار میں بے برکتی کا ہونا، پیسے آنا
            مگر فوراََ ختم ہو جانا، فیکٹری یا کارخانے میں مشینری یا سامان کا بار
            بار خراب ہونا، مال تیار کرنے میں دشواری کا ہونا، مال تیار کرتے ہی
            مال خراب ہو جانا، گاہکوں کا بلاوجہ پیسے روک لینا، گاہکوں کا بلا وجہ
            غصہ کرنا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>5.گھر پر نظر بد کی علامات:</Text>
          <Text style={mainStyles.description}>
            گھر میں اچانک لڑائی جھگڑے شروع ہو جانا، گھر میں بلا وجہ برتنوں کا
            ٹوٹنا، گھر کی الیکٹرک اشیاء کا خراب ہونا، گھرمیں بے سکونی کاہونا،
            بچوں یا بڑوں کا بار بار بیمار ہونا، مہمانوں کا گھر میں آ کر بےچینی
            محسوس کرنا، گھر کے پالتوں جانوروں کا عجیب رویّہ ہونے کا احساس ہونا،
            گھر سے رزق کا ختم ہونا یا تنگی ہونا، کھانا پکنے کے بعد خراب ہو جانا
            وغیرہ، گھر میں خوشی کے موقع پر پریشانیوں کا آنا وغیرہ۔
          </Text>

          <Text style={mainStyles.heading}>حسد کے اثرات اور ان کی علامات</Text>
          <Text style={mainStyles.description}>
            حسد کی علامات کی تفصیل (Envy / Jealousy) دل کی ایک روحانی بیماری ہے
            جس میں انسان دوسروں کی نعمت سے جلتا ہے اور چاہتا ہے کہ وہ نعمت اس سے
            چھن جائے، چاہے اسے خود نہ ملے۔قرآن و سنت کے مطابق حسد ایک گناہ ہے
            اور اس کے اثرات روحانی و جسمانی نقصان کی صورت میں ظاہر ہو سکتے ہیں۔:
            اللہ تعالیٰ قرآن پاک میں فرماتا ہے:"وَمِنْ شَرِّ حَاسِدٍ إِذَا
            حَسَدَ"(سورۃ الفلق، آیت 5) ترجمہ: "اور حسد کرنے والے کے شر سے بچو
            جب وہ حسد کرے۔
          </Text>

          <Text style={mainStyles.subheading}>
            1. رزق ، روزگار، نوکری پر حسد کے اثرات:
          </Text>
          <Text style={mainStyles.description}>
            اچھی نوکری اور کام ہونے کے باوجود ترقی کا نہ ہونا، نوکری کی جگہ سے
            بلا وجہ نکال دیا جانا، نوکری کی جگہ پر لوگوں کا بلاوجہ دشمنی کرنا،
            کاروباراچھا ہونے کے باوجود ترقی نہ ہونا، مستقبل کے منصوبے بار بار
            ناکام ہو نا، مسلسل قرض یا مالی تنگی کا شکار رہنا، ہر کوشش کے بعد
            مایوسی کا ہونا، دکان یا کاروبار میں گاہک کا نہ آنا، گھریا کاروبار
            سےبرکت کا ختم ہو جانا ، کام کرنے یا کام پر جانے کو دل نہ کرنا، کام
            پر جانے سے طبیعت خراب ہو جانا، بلا وجہ اکیسیڈنٹ ہو جانا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>
            2.رشتوں میں خر ابی ہونے کیلئےحسد کے اثرات:
          </Text>
          <Text style={mainStyles.description}>
            میاں بیوی میں بلاوجہ جھگڑے ہونا، پاکیزہ رشتوں میں بدگمانی ہونا،
            سسرال یا رشتہ داروں سے بیزاری ہونا، دوستوں یا خیرخواہوں کا دوری
            اختیار کرنا، کسی کو دیکھ کر دل میں کھٹک محسوس ہونا، ہر کسی کیلئے دل
            میں نفرت یا ندگمانی رکھنا، مہمانوں یا رشتے داروں سے نفرت کرنا،
            معاشرے میں اٹھے بیٹھے کو اچھا نہ سمجھنا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>
            3.ذہنی و نفسیاتی حسد کے اثرات:
          </Text>
          <Text style={mainStyles.description}>
            ہر وقت اداسی کا رہنا،ہر وقت بےچین رہنا، ڈپریشن اور وسوسوں کا شکار
            رہنا، بلا وجہ دوسروں سے موازنہ کرتے رہنا، خود کو کمتر محسوس کرنا، دل
            کا تنگ ہونا، کسی کی کامیابی پرخوش نہ ہونا، طبیعت بوجھل رہنا، سستی
            اور کاہلی کا شکار رہنا، زندگی میں ناشکری اور نافرمانی کا جذبہ رہنا
            وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>4. حسد کے جسمانی اثرات:</Text>
          <Text style={mainStyles.description}>
            بار بار بیمار پڑنا (خاص طور پر بخار، کمزوری، بدہضمی)، دماغی الجھنوں
            کا شکار رہنا، نیند کا خراب ہونا، اچانک چہرے پر رونق کا خاتمہ ہو
            جانا، سر درد یا چکر آنا، جسم میں درد یا وزن محسوس ہونا، وزن میں کمی
            یا زیادتی ہونا، پیٹ میں عجیب حرکت محسوس ہونا، دل کی دھڑکن میں اتار
            چڑھاؤرہنا، طبیعت میں بیزاری ہونا، ہر وقت غصے میں رہنا وغیرہ۔
          </Text>

          <Text style={mainStyles.subheading}>5.گھر یا ماحول پر اثرات:</Text>
          <Text style={mainStyles.description}>
            گھر میں برکت کا ختم ہو جانا، گھر میں عجیب سی سستی اور خاموشی کا
            رہنا، گھر میں آئے ہوئے مہمانوں کا بےچین ہو نا، ہر وقت لڑائی
            جھگڑارہنا، ہر کسی سے بدگمانی یا ناراضگی یا نفرت کا احساس ہونا، چھوٹے
            بچوں کا بلا وجہ رونا، بچوں کا نیند یا جاگتے میں ڈرنا، گھر کی
            چیزوں کا خراب ہونا، کھانا جلد ختم ہونا یا خراب ہو جانا، گھر میں
            بیماریوں کا ڈیرہ ڈال لینا، گھر میں رزق کی تنگی ہونا وغیرہ{" "}
          </Text>
        </View>
      </ScrollView>
    </CustomBackground>
  );
}
